[
  {
    "@odata.type": "#microsoft.graph.managedIOSStoreApp",
    "id": "801c6f2a-c99b-492b-937e-134daba80f8c",
    "displayName": "365Pay",
    "description": "Welcome to the 365Pay app, your passport to the 365 Connected Campus ecosystem of products!\r\n\r\nThe 365Pay app is the quickest way to buy products across a variety of experiences offered in your workplace. Use your unique QR code to touchlessly checkout at any 365 self-checkout technology. You can also earn loyalty points while ordering ahead from the cafeteria, scan and pay for products using the app itself and/or by vending a snack or coffee where offered! The 365Pay app is also the best way to stay up to date on new and exciting products and promotions being offered at your location!",
    "publisher": "365 Retail Markets, LLC",
    "largeIcon": null,
    "createdDateTime": "2025-09-09T19:52:01Z",
    "lastModifiedDateTime": "2025-09-09T19:52:01Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "appAvailability": "lineOfBusiness",
    "version": null,
    "bundleId": "com.365rm.365pay",
    "appStoreUrl": "https://itunes.apple.com/us/app/365pay/id1087422156?mt=8",
    "applicableDeviceType": {
      "iPad": true,
      "iPhoneAndIPod": true
    },
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v9_0": false,
      "v10_0": false,
      "v11_0": false,
      "v12_0": false,
      "v13_0": false,
      "v14_0": true,
      "v15_0": false,
      "v16_0": false,
      "v17_0": false,
      "v18_0": false,
      "v26_0": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('801c6f2a-c99b-492b-937e-134daba80f8c')/microsoft.graph.managedIOSStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.iosStoreAppAssignmentSettings",
          "vpnConfigurationId": null,
          "uninstallOnDeviceRemoval": true,
          "isRemovable": true,
          "preventManagedAppBackup": false
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.managedIOSStoreApp",
    "id": "09f09210-a830-41ba-9b7c-1372e880b972",
    "displayName": "Adobe Acrobat Reader",
    "description": "Adobe Acrobat Reader is the free global standard for reliably viewing, signing, and commenting on PDF documents. \r\n\r\nVIEW PDFs \r\n• Quickly open and view PDF documents. \r\n• Search, scroll, and zoom in and out. \r\n• Choose Single Page or Continuous scroll mode. \r\n\r\nANNOTATE PDFs \r\n• Comment on PDFs using sticky notes and drawing tools. \r\n• Highlight and mark up text with annotation tools. \r\n• View and respond to annotations in the comments list. \r\n• Use Apple Pencil with iPad Pro for exceptional commenting precision. \r\n\r\nWORK WITH OTHERS AND SHARE PDFs \r\n• Quickly access documents shared for viewing, review, or signature. \r\n• Collaborate with others by adding your comments to PDFs sent to you for review.  \r\n• Receive activity notifications for files you’ve shared for viewing and review. \r\n• Track pending actions on documents shared with you. \r\n• Easily share PDFs with others by creating a links you can send by email. \r\n\r\nWORK WITH SCANNED DOCUMENTS \r\n• Easily access scanned PDFs that you’ve captured using the free Adobe Scan app. \r\n• Open your scans in Acrobat Reader to fill in, sign, review, and share. \r\n\r\nFILL AND SIGN FORMS \r\n• Quickly fill out PDF forms by typing text into fields. \r\n• Use your finger or Apple Pencil to e-sign any PDF document. \r\n\r\nSTORE AND PRINT FILES \r\n• Sign in to your free Adobe Document Cloud account to store access files across devices.  \r\n• Connect to your Dropbox account and access other storage providers including iCloud Drive, Box, Microsoft OneDrive, and Google Drive. \r\n• Print documents from your device. \r\n\r\nIN-APP PURCHASE \r\nFor even more PDF power, subscribe to Adobe Acrobat Pro DC, Adobe PDF Pack, or Adobe Export PDF. Subscriptions work across desktop, web, and mobile. \r\n\r\nACROBAT PRO DC \r\n• Organize and edit PDFs. \r\n• Create PDF files from documents or images. \r\n• Export PDFs to Microsoft Word, Excel, or PowerPoint. \r\n• Combine files into one PDF. \r\n• Send documents to others for review. \r\n\r\nADOBE PDF PACK \r\n• Create PDF files from documents or images. \r\n• Export PDFs to Microsoft Word, Excel, PowerPoint or RTF. \r\n• Organize and combine files. \r\n• Send documents to others for review. \r\n\r\nEXPORT PDF \r\n• Export PDFs to Microsoft Word, Excel, PowerPoint, or RTF. \r\n\r\nIN-APP PURCHASE DETAILS \r\n• An Acrobat Pro DC subscription is US$24.99/month (includes Acrobat Pro DC software plus PDF Pack). \r\n• A PDF Pack subscription is US$9.99/month (includes Export PDF). \r\n• An Export PDF subscription is US$23.99/year. \r\n• Payment will be charged to your iTunes account at confirmation of purchase. \r\n• Subscriptions automatically renew unless auto-renew is turned off at least 24 hours before the end of the current period. \r\n\r\nTerms & Conditions: Your use of this application is governed by the Adobe General Terms of Use (https://www.adobe.com/legal/terms-linkfree.html and the Adobe Privacy Policy (https://www.adobe.com/privacy/policy-linkfree.html).",
    "publisher": "Adobe Inc.",
    "largeIcon": null,
    "createdDateTime": "2025-09-09T19:51:03Z",
    "lastModifiedDateTime": "2025-09-09T19:51:03Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "appAvailability": "lineOfBusiness",
    "version": null,
    "bundleId": "com.adobe.Adobe-Reader",
    "appStoreUrl": "https://itunes.apple.com/us/app/adobe-acrobat-reader-for-pdf/id469337564?mt=8",
    "applicableDeviceType": {
      "iPad": true,
      "iPhoneAndIPod": true
    },
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v9_0": false,
      "v10_0": false,
      "v11_0": true,
      "v12_0": false,
      "v13_0": false,
      "v14_0": false,
      "v15_0": false,
      "v16_0": false,
      "v17_0": false,
      "v18_0": false,
      "v26_0": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('09f09210-a830-41ba-9b7c-1372e880b972')/microsoft.graph.managedIOSStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "37aff8f6-7eca-4782-8474-37747dfa8540",
    "displayName": "Adobe Acrobat Reader: Edit PDF",
    "description": "Sign PDFs on the go. Effortlessly fill in, send & receive files.",
    "publisher": "Adobe",
    "largeIcon": null,
    "createdDateTime": "2025-03-07T16:34:30Z",
    "lastModifiedDateTime": "2025-08-21T10:31:39Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.adobe.reader",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.adobe.reader",
    "appIdentifier": "com.adobe.reader",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.adobe.reader&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('37aff8f6-7eca-4782-8474-37747dfa8540')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.managedIOSStoreApp",
    "id": "cd794d8a-a391-4d38-b860-58a5e7bc7cdb",
    "displayName": "Atom Edge",
    "description": "Introducing ATOM EdgeATOM Edge is leading the charge in transforming corporate security with its integrated suite of services, tailored to enhance businesses' operational capabilities. Our application provides a holistic approach to security management, seamlessly blending automation, real-time analytics, and strategic planning to foster a safe and productive working environment.Key Features:Automated Compliance Management: Simplifies adherence to regulatory changes, ensuring continuous compliance with the latest standards.Real-Time Analytics and Risk Assessment: Empowers users with tools for immediate threat detection and evaluation, facilitating prompt and well-informed decision-making.Centralized Operations Module: Serves as a central hub for security management, integrating diverse yet interconnected features for a cohesive user experience.Important Modules Details:Operations:Article Found Register: Improves accountability for on-premises items, significantly reducing incidents of lost property.Law Enforcement Visit List: Tracks law enforcement visits, facilitating proper documentation and follow-up actions.Event Protection List: Optimizes security resource deployment during events for heightened efficiency and vigilance.Incident Management: Provides a comprehensive toolset for recording, analyzing, and resolving security incidents, strengthening both reactive and proactive measures.Material Movement:1. Inward Material Movement: Monitors material entry, ensuring security and traceability.2. Outward Material Movement: Tracks material exits, ensuring proper authorization and documentation.Pass Management:1. Day Pass Management: Streamlines the issuance and tracking of day passes.2. Visitor Pass Management: Manages visitor pass issuance and records.3. Vendor Pass Management: Ensures efficient management and tracking of vendor passes.4. SEZ Pass Management: Specialized management of SEZ passes, maintaining stringent security and compliance standards.Guarding Operations:1. Guarding Master Data and Reports: Provides comprehensive data and reporting tools for efficient guarding operations.2. Female Drop Pickup: Facilitates safe transportation arrangements for female employees.3. Key Management Master: Efficiently manages keys and access control.4. SLA Violation Penalty: Tracks and manages penalties for service-level agreement violations.Enhanced Security and Efficiency:ATOM Edge's multifaceted approach to security management ensures comprehensive coverage of your business's security needs. From material movement tracking to detailed pass management, our application offers a seamless and secure operational experience. With ATOM Edge, users not only deploy a security solution but also elevate to a smarter, safer, and more efficient approach to managing their business's security requirements. User Guide and Benefits:ATOM Edge offers an intuitive user interface, making it easy for users to navigate through its various modules and functionalities. Whether you're a security manager, operations executive, or compliance officer, ATOM Edge empowers you to:- Monitor security compliance effortlessly, ensuring your business remains up-to-date with regulations.- Respond swiftly to security threats with real-time analytics and risk assessment tools.- Streamline operational workflows with centralized management and automation features.- Enhance accountability and reduce incidents with detailed tracking and incident management capabilities.With ATOM Edge, users gain peace of mind knowing that their business is equipped with a robust security solution that not only meets but exceeds their operational needs.",
    "publisher": "Arlanto GMBH",
    "largeIcon": null,
    "createdDateTime": "2025-09-09T19:52:29Z",
    "lastModifiedDateTime": "2025-09-09T19:52:29Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "appAvailability": "lineOfBusiness",
    "version": null,
    "bundleId": "com.arlanto.atomedge",
    "appStoreUrl": "https://itunes.apple.com/us/app/atom-edge/id6472163711?mt=8",
    "applicableDeviceType": {
      "iPad": true,
      "iPhoneAndIPod": true
    },
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v9_0": false,
      "v10_0": false,
      "v11_0": false,
      "v12_0": true,
      "v13_0": false,
      "v14_0": false,
      "v15_0": false,
      "v16_0": false,
      "v17_0": false,
      "v18_0": false,
      "v26_0": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('cd794d8a-a391-4d38-b860-58a5e7bc7cdb')/microsoft.graph.managedIOSStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "b4476ec7-3aad-48d0-9a33-5ee80caee325",
    "displayName": "Azure Information Protection",
    "description": "Securely collaborate with others by viewing and sharing protected files.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-06-26T21:49:22Z",
    "lastModifiedDateTime": "2025-08-21T10:31:39Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.ipviewer",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.ipviewer",
    "appIdentifier": "com.microsoft.ipviewer",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.ipviewer&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('b4476ec7-3aad-48d0-9a33-5ee80caee325')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "bb8ff244-e505-43f6-b292-26fe91501b6b",
    "displayName": "cocktailbarservice",
    "description": null,
    "publisher": "Samsung",
    "largeIcon": null,
    "createdDateTime": "2025-06-09T15:55:34Z",
    "lastModifiedDateTime": "2025-06-09T15:55:34Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.samsung.android.app.cocktailbarservice",
    "appIdentifier": "com.samsung.android.app.cocktailbarservice",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.samsung.android.app.cocktailbarservice",
    "isPrivate": false,
    "isSystemApp": true,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('bb8ff244-e505-43f6-b292-26fe91501b6b')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "661e7b38-1382-40dd-be57-43ce13873ec1",
    "displayName": "com.microsoft.outlooklite",
    "description": null,
    "publisher": null,
    "largeIcon": null,
    "createdDateTime": "2025-01-13T20:47:49Z",
    "lastModifiedDateTime": "2025-10-06T22:01:50Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/work/apps/details?id=com.microsoft.outlooklite",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.outlooklite",
    "appIdentifier": "com.microsoft.outlooklite",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.outlooklite&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('661e7b38-1382-40dd-be57-43ce13873ec1')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.winGetApp",
    "id": "229c3b7f-4606-4191-ad26-42cfa8e012dc",
    "displayName": "Company Portal",
    "description": "Microsoft Intune helps organizations manage access to corporate apps, data, and resources. Company Portal is the app that lets you, as an employee of your company, securely access those resources.\r\n\r\nBefore you can use this app, make sure your IT admin has set up your work account. Your company must also have a subscription to Microsoft Intune.\r\n\r\nCompany Portal helps simplify the tasks you need to do for work:\r\n\r\n- Enroll your device to access corporate resources, including Office, email, and OneDrive for Business\r\n- Sign in to corporate resources with company-issued certificates\r\n- Reduce the number of times you need to sign in to corporate resources with single sign-on\r\n- Browse and install approved business apps from your IT department or the Microsoft Store for Business\r\n- View and manage your enrolled devices – and wipe them if they get lost or stolen\r\n- Get help directly from your IT department through available contact information\r\n \r\nA note about Intune: every organization has different access requirements, and will use Intune in ways that they determine will best manage their information. Some functionality might be unavailable in certain countries. If you have questions about how this app is being used within your organization, your company’s IT administrator should have those answers for you. Microsoft, your network provider, and your device’s manufacturer do not know how Intune will be used by your organization.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-29T21:30:36Z",
    "lastModifiedDateTime": "2025-01-29T21:30:36Z",
    "isFeatured": false,
    "privacyInformationUrl": "http://go.microsoft.com/fwlink/?LinkID=316999",
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "manifestHash": null,
    "packageIdentifier": "9WZDNCRFJ3PZ",
    "installExperience": {
      "runAsAccount": "user"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('229c3b7f-4606-4191-ad26-42cfa8e012dc')/microsoft.graph.winGetApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.winGetAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.win32LobApp",
    "id": "5963bab2-e10c-4671-8c39-9feb960eebb8",
    "displayName": "DesktopInfoInstall",
    "description": "DesktopInfoInstall",
    "publisher": "CONTOSO",
    "largeIcon": null,
    "createdDateTime": "2025-08-18T18:45:03Z",
    "lastModifiedDateTime": "2025-08-18T18:48:47Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "committedContentVersion": "1",
    "fileName": "DesktopInfoInstall.intunewin",
    "size": 3724496,
    "installCommandLine": "powershell -executionpolicy bypass -file DesktopInfoInstall.ps1",
    "uninstallCommandLine": "powershell -executionpolicy bypass -file DesktopInfoInstall.ps1",
    "applicableArchitectures": "none",
    "allowedArchitectures": null,
    "minimumFreeDiskSpaceInMB": null,
    "minimumMemoryInMB": null,
    "minimumNumberOfProcessors": null,
    "minimumCpuSpeedInMHz": null,
    "msiInformation": null,
    "setupFilePath": "DesktopInfoInstall.ps1",
    "minimumSupportedWindowsRelease": "Windows10_22H2",
    "displayVersion": "",
    "allowAvailableUninstall": true,
    "activeInstallScript": null,
    "activeUninstallScript": null,
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v8_1": false,
      "v10_0": false,
      "v10_1607": false,
      "v10_1703": false,
      "v10_1709": false,
      "v10_1803": false,
      "v10_1809": false,
      "v10_1903": false,
      "v10_1909": false,
      "v10_2004": false,
      "v10_2H20": false,
      "v10_21H1": false
    },
    "detectionRules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppFileSystemDetection",
        "path": "C:\\Windows\\Intune Resources\\DesktopInfo",
        "fileOrFolderName": "DesktopInfo.exe",
        "check32BitOn64System": false,
        "detectionType": "exists",
        "operator": "notConfigured",
        "detectionValue": null
      }
    ],
    "requirementRules": [],
    "rules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppFileSystemRule",
        "ruleType": "detection",
        "path": "C:\\Windows\\Intune Resources\\DesktopInfo",
        "fileOrFolderName": "DesktopInfo.exe",
        "check32BitOn64System": false,
        "operationType": "exists",
        "operator": "notConfigured",
        "comparisonValue": null
      }
    ],
    "installExperience": {
      "runAsAccount": "system",
      "maxRunTimeInMinutes": 60,
      "deviceRestartBehavior": "allow"
    },
    "returnCodes": [
      {
        "returnCode": 0,
        "type": "success"
      },
      {
        "returnCode": 1707,
        "type": "success"
      },
      {
        "returnCode": 3010,
        "type": "softReboot"
      },
      {
        "returnCode": 1641,
        "type": "hardReboot"
      },
      {
        "returnCode": 1618,
        "type": "retry"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('5963bab2-e10c-4671-8c39-9feb960eebb8')/microsoft.graph.win32LobApp/assignments",
    "assignments": [
      {
        "id": "247c3463-4aa7-4d07-afe6-3def144ba810_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "247c3463-4aa7-4d07-afe6-3def144ba810"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.win32LobAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null,
          "deliveryOptimizationPriority": "notConfigured",
          "autoUpdateSettings": null
        }
      },
      {
        "id": "277aae45-b2c5-49dd-9ff1-fa07148d0feb_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "277aae45-b2c5-49dd-9ff1-fa07148d0feb"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.win32LobAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null,
          "deliveryOptimizationPriority": "notConfigured",
          "autoUpdateSettings": null
        }
      },
      {
        "id": "68faab98-774e-41ee-87df-1aebd1ebb787_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "68faab98-774e-41ee-87df-1aebd1ebb787"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.win32LobAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null,
          "deliveryOptimizationPriority": "notConfigured",
          "autoUpdateSettings": null
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.managedAndroidStoreApp",
    "id": "d54ef829-5328-4335-911d-1e5604f14ea5",
    "displayName": "Edge",
    "description": "Microsoft Edge, now available on Android, creates one continuous browsing experience for Windows 10 users across their devices.Content and data sync seamlessly in the background, so users can browse across devices, without skipping a beat.\r\n\r\nFamiliar Microsoft Edge features like the Hub allow users to organize the web in a way that cuts through the clutter, making it easier to find, view and manage their content on - the - go.\r\n\r\nMicrosoft Edge is designed for Windows 10 users to browse the web how they need to, wherever they are, without disrupting their flow.\r\n\r\nContinue on PC: Go anywhere and pick up where you left off by seamlessly moving content between your mobile device and PC(requires Windows 10 Fall Creator’s Update).\r\n\r\nData Sync: Your favorites and reading list are synced across your devices, so no matter the device, your browser is always personalized to you.\r\n\r\nHub View: With your favorites, reading list, history and books all in one place, finding and managing your content is made simple.\r\n\r\nReading View: Reorganize the content on a webpage to make it easier to focus on what you’re reading.\r\n\r\nQR Code Reader: Easily read QR codes at the touch of a button.Microsoft Edge will pull up the reading and information right onto your screen.\r\n\r\nVoice Search: You can now use your voice to search the web.Ask a question or speak a prompt to use the web in more natural, familiar ways.\r\n\r\nInPrivate: When you browse with InPrivate mode, your browsing data(like your history, temporary internet files, and cookies) isn't saved on your PC once you're done.\r\n\r\nWe want to hear from you! Submit feedback in the app to tell us what you think!",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T20:33:57Z",
    "lastModifiedDateTime": "2025-03-27T03:11:54Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "appAvailability": "lineOfBusiness",
    "version": null,
    "packageId": "com.microsoft.emmx",
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.emmx",
    "minimumSupportedOperatingSystem": {
      "v4_0": false,
      "v4_0_3": false,
      "v4_1": false,
      "v4_2": false,
      "v4_3": false,
      "v4_4": true,
      "v5_0": false,
      "v5_1": false,
      "v6_0": false,
      "v7_0": false,
      "v7_1": false,
      "v8_0": false,
      "v8_1": false,
      "v9_0": false,
      "v10_0": false,
      "v11_0": false,
      "v12_0": false,
      "v13_0": false,
      "v14_0": false,
      "v15_0": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('d54ef829-5328-4335-911d-1e5604f14ea5')/microsoft.graph.managedAndroidStoreApp/assignments",
    "assignments": [
      {
        "id": "c2b14659-9ca4-4d32-a908-5ddbc47bd455_1_0_f66e796c-09d5-4b99-b13f-e12dcb524c9b",
        "intent": "required",
        "settings": null,
        "source": "policySets",
        "sourceId": "f66e796c-09d5-4b99-b13f-e12dcb524c9b",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "c2b14659-9ca4-4d32-a908-5ddbc47bd455"
        }
      },
      {
        "id": "bb1c9320-e431-4903-af91-05aa14baffe2_1_1_f66e796c-09d5-4b99-b13f-e12dcb524c9b",
        "intent": "required",
        "settings": null,
        "source": "policySets",
        "sourceId": "f66e796c-09d5-4b99-b13f-e12dcb524c9b",
        "target": {
          "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "bb1c9320-e431-4903-af91-05aa14baffe2"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.managedIOSStoreApp",
    "id": "13fa5cd2-f0cf-4738-b60c-fc3ec4d224e4",
    "displayName": "Edge",
    "description": "Microsoft Edge, now available on iOS, creates one continuous browsing experience for Windows 10 users across their devices. Content and data sync seamlessly in the background, so users can browse across devices, without skipping a beat. Familiar Microsoft Edge features like the Hub allow users to organize the web in a way that cuts through the clutter, making it easier to find, view and manage their content on-the-go. Microsoft Edge is designed for Windows 10 users to browse the web how they need to, wherever they are, without disrupting their flow.\r\n\r\nContinue on PC: Go anywhere and pick up where you left off by seamlessly moving content between your mobile device and PC (requires Windows 10 Fall Creator’s Update).\r\n\r\nData Sync: Your favorites, passwords, and reading list are synced across your devices, so no matter the device, your browser is always personalized to you.\r\n\r\nHub View: With your favorites, reading list, history and books all in one place, finding and managing your content is made simple.\r\n\r\nQR Code Reader: Easily read QR codes at the touch of a button. Microsoft Edge will pull up the reading and information right onto your screen.\r\n\r\nVoice Search: You can now use your voice to search the web. Ask a question or speak a prompt to use the web in more natural, familiar ways.\r\n\r\nInPrivate: When you browse with InPrivate mode, your browsing data (like your history, temporary internet files, and cookies) isn't saved on your PC once you're done.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T20:33:57Z",
    "lastModifiedDateTime": "2025-09-09T19:50:26Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "appAvailability": "lineOfBusiness",
    "version": null,
    "bundleId": "com.microsoft.msedge",
    "appStoreUrl": "https://itunes.apple.com/us/app/microsoft-edge/id1288723196?mt=8",
    "applicableDeviceType": {
      "iPad": true,
      "iPhoneAndIPod": true
    },
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v9_0": true,
      "v10_0": false,
      "v11_0": false,
      "v12_0": false,
      "v13_0": false,
      "v14_0": false,
      "v15_0": false,
      "v16_0": false,
      "v17_0": false,
      "v18_0": false,
      "v26_0": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('13fa5cd2-f0cf-4738-b60c-fc3ec4d224e4')/microsoft.graph.managedIOSStoreApp/assignments",
    "assignments": [
      {
        "id": "c2b14659-9ca4-4d32-a908-5ddbc47bd455_1_0_f66e796c-09d5-4b99-b13f-e12dcb524c9b",
        "intent": "required",
        "source": "policySets",
        "sourceId": "f66e796c-09d5-4b99-b13f-e12dcb524c9b",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "c2b14659-9ca4-4d32-a908-5ddbc47bd455"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.iosStoreAppAssignmentSettings",
          "vpnConfigurationId": null,
          "uninstallOnDeviceRemoval": null,
          "isRemovable": null,
          "preventManagedAppBackup": null
        }
      },
      {
        "id": "bb1c9320-e431-4903-af91-05aa14baffe2_1_1_f66e796c-09d5-4b99-b13f-e12dcb524c9b",
        "intent": "required",
        "settings": null,
        "source": "policySets",
        "sourceId": "f66e796c-09d5-4b99-b13f-e12dcb524c9b",
        "target": {
          "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "bb1c9320-e431-4903-af91-05aa14baffe2"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "404ad2ba-a6de-4aef-9773-912b679c0d55",
    "displayName": "Firefox Fast & Private Browser",
    "description": "Build your web browser around you with private search, and more.",
    "publisher": "Mozilla",
    "largeIcon": null,
    "createdDateTime": "2025-02-05T15:12:18Z",
    "lastModifiedDateTime": "2025-08-21T10:31:38Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=org.mozilla.firefox",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "org.mozilla.firefox",
    "appIdentifier": "org.mozilla.firefox",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=org.mozilla.firefox&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('404ad2ba-a6de-4aef-9773-912b679c0d55')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "fa138c2c-4ccd-41b6-9bc8-0f05e8d513cd",
    "displayName": "Google Chrome",
    "description": "Google's fast and secure browser",
    "publisher": "Google LLC",
    "largeIcon": null,
    "createdDateTime": "2025-01-15T06:21:02Z",
    "lastModifiedDateTime": "2025-08-21T10:31:40Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.android.chrome",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.android.chrome",
    "appIdentifier": "com.android.chrome",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.android.chrome&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('fa138c2c-4ccd-41b6-9bc8-0f05e8d513cd')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "0b5d7138-271f-44ed-8333-95793feebd63",
    "displayName": "Google Maps",
    "description": "Real-time GPS navigation & local suggestions for food, events, & activities",
    "publisher": "Google LLC",
    "largeIcon": null,
    "createdDateTime": "2025-02-04T20:30:36Z",
    "lastModifiedDateTime": "2025-08-21T10:31:38Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.google.android.apps.maps",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.google.android.apps.maps",
    "appIdentifier": "com.google.android.apps.maps",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.google.android.apps.maps&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('0b5d7138-271f-44ed-8333-95793feebd63')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "0292199e-9a02-492d-b60f-0035e192f010",
    "displayName": "Google Personal Safety",
    "description": null,
    "publisher": "Google",
    "largeIcon": null,
    "createdDateTime": "2025-06-05T14:40:30Z",
    "lastModifiedDateTime": "2025-06-05T14:40:30Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "cone.google.android.apps.safetyhub",
    "appIdentifier": "cone.google.android.apps.safetyhub",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=cone.google.android.apps.safetyhub",
    "isPrivate": false,
    "isSystemApp": true,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('0292199e-9a02-492d-b60f-0035e192f010')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "ba0754aa-2f7c-4c5a-88ce-525056e967ef",
    "displayName": "Google Photos",
    "description": "The home for your memories. Relive, share, and organize your photos.",
    "publisher": "Google LLC",
    "largeIcon": null,
    "createdDateTime": "2025-01-17T21:24:37Z",
    "lastModifiedDateTime": "2025-11-25T04:38:32Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.google.android.apps.photos",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.google.android.apps.photos",
    "appIdentifier": "com.google.android.apps.photos",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.google.android.apps.photos&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('ba0754aa-2f7c-4c5a-88ce-525056e967ef')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.win32LobApp",
    "id": "c85eb777-8080-42b3-8f65-e9f003aa87ee",
    "displayName": "Install ARM64 Teams app",
    "description": "Install ARM64 teams app",
    "publisher": "Microsoft Teams",
    "largeIcon": null,
    "createdDateTime": "2025-09-04T15:22:37Z",
    "lastModifiedDateTime": "2025-09-04T15:22:37Z",
    "isFeatured": false,
    "privacyInformationUrl": "",
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "committedContentVersion": "1",
    "fileName": "Install.intunewin",
    "size": 944,
    "installCommandLine": "install.ps1",
    "uninstallCommandLine": "uninstall.ps1",
    "applicableArchitectures": "none",
    "allowedArchitectures": "arm64",
    "minimumFreeDiskSpaceInMB": null,
    "minimumMemoryInMB": null,
    "minimumNumberOfProcessors": null,
    "minimumCpuSpeedInMHz": null,
    "msiInformation": null,
    "setupFilePath": "Install.ps1",
    "minimumSupportedWindowsRelease": "Windows11_23H2",
    "displayVersion": "Microsoft Teams",
    "allowAvailableUninstall": true,
    "activeInstallScript": null,
    "activeUninstallScript": null,
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v8_1": false,
      "v10_0": false,
      "v10_1607": false,
      "v10_1703": false,
      "v10_1709": false,
      "v10_1803": false,
      "v10_1809": false,
      "v10_1903": false,
      "v10_1909": false,
      "v10_2004": false,
      "v10_2H20": false,
      "v10_21H1": false
    },
    "detectionRules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppRegistryDetection",
        "check32BitOn64System": false,
        "keyPath": "HKLM\\SOFTWARE\\Microsoft\\Teams",
        "valueName": "Version",
        "detectionType": "exists",
        "operator": "notConfigured",
        "detectionValue": ""
      }
    ],
    "requirementRules": [],
    "rules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppRegistryRule",
        "ruleType": "detection",
        "check32BitOn64System": false,
        "keyPath": "HKLM\\SOFTWARE\\Microsoft\\Teams",
        "valueName": "Version",
        "operationType": "exists",
        "operator": "notConfigured",
        "comparisonValue": ""
      }
    ],
    "installExperience": {
      "runAsAccount": "system",
      "maxRunTimeInMinutes": 60,
      "deviceRestartBehavior": "allow"
    },
    "returnCodes": [
      {
        "returnCode": 0,
        "type": "success"
      },
      {
        "returnCode": 1707,
        "type": "success"
      },
      {
        "returnCode": 3010,
        "type": "softReboot"
      },
      {
        "returnCode": 1641,
        "type": "hardReboot"
      },
      {
        "returnCode": 1618,
        "type": "retry"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('c85eb777-8080-42b3-8f65-e9f003aa87ee')/microsoft.graph.win32LobApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "aa5ac519-3e42-4954-a51c-7232ca8b6614",
    "displayName": "Intune Company Portal",
    "description": "Get access to your organization’s resources and keep them secure.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T18:55:28Z",
    "lastModifiedDateTime": "2025-08-21T10:31:38Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.windowsintune.companyportal",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.windowsintune.companyportal",
    "appIdentifier": "com.microsoft.windowsintune.companyportal",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.windowsintune.companyportal&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('aa5ac519-3e42-4954-a51c-7232ca8b6614')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "a90683aa-b5a0-42a1-974a-e26c05ffdbad",
    "displayName": "Link to Windows",
    "description": "Access your phone's notifications, calls, apps, photos & texts on your PC",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-02-04T20:29:55Z",
    "lastModifiedDateTime": "2025-08-21T10:31:38Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.appmanager",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.appmanager",
    "appIdentifier": "com.microsoft.appmanager",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.appmanager&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('a90683aa-b5a0-42a1-974a-e26c05ffdbad')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "5d76caed-b52e-43ca-87c3-26754c8e6f6d",
    "displayName": "Managed Home Screen",
    "description": "A Microsoft Intune managed, multi App Kiosk mode launcher",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T18:55:28Z",
    "lastModifiedDateTime": "2025-08-21T10:31:38Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.launcher.enterprise",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.launcher.enterprise",
    "appIdentifier": "com.microsoft.launcher.enterprise",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.launcher.enterprise&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('5d76caed-b52e-43ca-87c3-26754c8e6f6d')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "03b4872b-bd4d-41d4-8358-fa2a33ba8f4b",
    "displayName": "Microphone Blocker",
    "description": "Protect your phone microphone against unethical microphone usage.",
    "publisher": "FRENZYCODERS",
    "largeIcon": null,
    "createdDateTime": "2025-08-20T17:31:04Z",
    "lastModifiedDateTime": "2025-08-21T10:31:39Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.frenzycoders.microphoneblockerantispyware",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.frenzycoders.microphoneblockerantispyware",
    "appIdentifier": "com.frenzycoders.microphoneblockerantispyware",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.frenzycoders.microphoneblockerantispyware&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('03b4872b-bd4d-41d4-8358-fa2a33ba8f4b')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.officeSuiteApp",
    "id": "80ae0412-fcce-4530-97cc-dd713a31056e",
    "displayName": "Microsoft 365 Apps - Visio x64",
    "description": "Microsoft 365 Apps - Visio x64",
    "publisher": "Microsoft",
    "largeIcon": null,
    "createdDateTime": "2025-05-17T15:31:00Z",
    "lastModifiedDateTime": "2025-05-17T15:31:00Z",
    "isFeatured": true,
    "privacyInformationUrl": "https://privacy.microsoft.com/privacystatement",
    "informationUrl": "https://products.office.com/explore-office-for-home",
    "owner": "Microsoft",
    "developer": "Microsoft",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "autoAcceptEula": true,
    "productIds": [
      "o365ProPlusRetail"
    ],
    "useSharedComputerActivation": false,
    "updateChannel": "current",
    "officeSuiteAppDefaultFileFormat": "officeOpenDocumentFormat",
    "officePlatformArchitecture": "x64",
    "localesToInstall": [],
    "installProgressDisplayLevel": "none",
    "shouldUninstallOlderVersionsOfOffice": true,
    "targetVersion": "",
    "updateVersion": "",
    "officeConfigurationXml": null,
    "excludedApps": {
      "access": false,
      "bing": false,
      "excel": false,
      "groove": true,
      "infoPath": true,
      "lync": true,
      "oneDrive": false,
      "oneNote": false,
      "outlook": false,
      "powerPoint": false,
      "publisher": false,
      "sharePointDesigner": true,
      "teams": false,
      "visio": false,
      "word": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('80ae0412-fcce-4530-97cc-dd713a31056e')/microsoft.graph.officeSuiteApp/assignments",
    "assignments": [
      {
        "id": "acacacac-9df4-4c7d-9d50-4ef0226f57a9_0_0",
        "intent": "available",
        "settings": null,
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.officeSuiteApp",
    "id": "f96d83a3-9080-4b70-abdb-b82cb425f467",
    "displayName": "Microsoft 365 Apps for Windows 10 and later",
    "description": "Microsoft 365 Apps for Windows 10 and later",
    "publisher": "Microsoft",
    "largeIcon": null,
    "createdDateTime": "2025-05-17T14:13:38Z",
    "lastModifiedDateTime": "2025-05-17T14:25:44Z",
    "isFeatured": true,
    "privacyInformationUrl": "https://privacy.microsoft.com/privacystatement",
    "informationUrl": "https://products.office.com/explore-office-for-home",
    "owner": "Microsoft",
    "developer": "Microsoft",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "autoAcceptEula": true,
    "productIds": [
      "o365ProPlusRetail"
    ],
    "useSharedComputerActivation": false,
    "updateChannel": "current",
    "officeSuiteAppDefaultFileFormat": "officeOpenDocumentFormat",
    "officePlatformArchitecture": "x64",
    "localesToInstall": [],
    "installProgressDisplayLevel": "none",
    "shouldUninstallOlderVersionsOfOffice": true,
    "targetVersion": "",
    "updateVersion": "",
    "officeConfigurationXml": null,
    "excludedApps": {
      "access": false,
      "bing": false,
      "excel": false,
      "groove": true,
      "infoPath": true,
      "lync": true,
      "oneDrive": false,
      "oneNote": false,
      "outlook": false,
      "powerPoint": false,
      "publisher": false,
      "sharePointDesigner": true,
      "teams": false,
      "visio": false,
      "word": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('f96d83a3-9080-4b70-abdb-b82cb425f467')/microsoft.graph.officeSuiteApp/assignments",
    "assignments": [
      {
        "id": "247c3463-4aa7-4d07-afe6-3def144ba810_1_0",
        "intent": "required",
        "settings": null,
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "247c3463-4aa7-4d07-afe6-3def144ba810"
        }
      },
      {
        "id": "68faab98-774e-41ee-87df-1aebd1ebb787_1_0",
        "intent": "required",
        "settings": null,
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "68faab98-774e-41ee-87df-1aebd1ebb787"
        }
      },
      {
        "id": "277aae45-b2c5-49dd-9ff1-fa07148d0feb_1_0",
        "intent": "required",
        "settings": null,
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "277aae45-b2c5-49dd-9ff1-fa07148d0feb"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "eb3e29a8-25ea-4367-87b0-e95bac598fd7",
    "displayName": "Microsoft 365 Copilot",
    "description": "Build presentations from a prompt, summarize notes, and quickly budget with AI",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T20:47:48Z",
    "lastModifiedDateTime": "2025-12-24T21:35:01Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.officehubrow",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.office.officehubrow",
    "appIdentifier": "com.microsoft.office.officehubrow",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.officehubrow&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('eb3e29a8-25ea-4367-87b0-e95bac598fd7')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "5e3151bf-8bed-4367-88c4-979567458981",
    "displayName": "Microsoft Authenticator",
    "description": "No more passwords, easier sign-in, and greater protection for your accounts.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T18:55:28Z",
    "lastModifiedDateTime": "2025-08-21T10:31:38Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.azure.authenticator",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.azure.authenticator",
    "appIdentifier": "com.azure.authenticator",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.azure.authenticator&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('5e3151bf-8bed-4367-88c4-979567458981')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "399e01ac-c958-49a7-b004-d72361b3c107_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "399e01ac-c958-49a7-b004-d72361b3c107"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "fa46b24c-09c2-4098-8b63-1cbd6ed9baaa",
    "displayName": "Microsoft Copilot AI Assistant",
    "description": "AI Chat & Digital Assistant: AI Image Generator, Document Writing Tool & Chatbot",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-03-07T16:34:30Z",
    "lastModifiedDateTime": "2025-11-05T19:17:06Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.copilot",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.copilot",
    "appIdentifier": "com.microsoft.copilot",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.copilot&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('fa46b24c-09c2-4098-8b63-1cbd6ed9baaa')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidStoreApp",
    "id": "d1f6b71f-49b1-4f64-b851-bfa3af2f0807",
    "displayName": "Microsoft Defender: Antivirus",
    "description": "Microsoft Defender: Antivirus",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T18:48:52Z",
    "lastModifiedDateTime": "2025-03-27T03:12:25Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "1.0.7128.0101",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.scmx",
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.scmx&pli=1",
    "minimumSupportedOperatingSystem": {
      "v4_0": true,
      "v4_0_3": false,
      "v4_1": false,
      "v4_2": false,
      "v4_3": false,
      "v4_4": false,
      "v5_0": false,
      "v5_1": false,
      "v6_0": false,
      "v7_0": false,
      "v7_1": false,
      "v8_0": false,
      "v8_1": false,
      "v9_0": false,
      "v10_0": false,
      "v11_0": false,
      "v12_0": false,
      "v13_0": false,
      "v14_0": false,
      "v15_0": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('d1f6b71f-49b1-4f64-b851-bfa3af2f0807')/microsoft.graph.androidStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "c949673e-f2e7-4caf-b4d7-f085c2202fbd",
    "displayName": "Microsoft Defender: Antivirus",
    "description": "Antivirus and malware protection. Online security for all of your devices.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T19:43:59Z",
    "lastModifiedDateTime": "2025-10-17T05:54:51Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.scmx",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.scmx",
    "appIdentifier": "com.microsoft.scmx",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.scmx&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('c949673e-f2e7-4caf-b4d7-f085c2202fbd')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "399e01ac-c958-49a7-b004-d72361b3c107_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "399e01ac-c958-49a7-b004-d72361b3c107"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "dcfa5fbe-d019-4d70-843c-544418e5f0b0",
    "displayName": "Microsoft Edge Beta",
    "description": "Enhance browsing with AI-powered features and Copilot.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-06-06T14:28:13Z",
    "lastModifiedDateTime": "2025-09-12T06:16:50Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.emmx.beta",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.emmx.beta",
    "appIdentifier": "com.microsoft.emmx.beta",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.emmx.beta&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('dcfa5fbe-d019-4d70-843c-544418e5f0b0')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "399e01ac-c958-49a7-b004-d72361b3c107_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "399e01ac-c958-49a7-b004-d72361b3c107"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "a7f44450-bf89-49a1-9bf2-8b167467ca71",
    "displayName": "Microsoft Edge: AI browser",
    "description": "Enhance browsing with AI-powered features and Copilot.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T20:36:16Z",
    "lastModifiedDateTime": "2025-08-21T10:31:38Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.emmx",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.emmx",
    "appIdentifier": "com.microsoft.emmx",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.emmx&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('a7f44450-bf89-49a1-9bf2-8b167467ca71')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "399e01ac-c958-49a7-b004-d72361b3c107_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "399e01ac-c958-49a7-b004-d72361b3c107"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "ad58470e-d98e-4411-adad-70e3d686ef0e",
    "displayName": "Microsoft Excel: Spreadsheets",
    "description": "Use powerful, industry-leading AI tools to generate visual charts from any data",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-02-05T15:10:37Z",
    "lastModifiedDateTime": "2025-10-17T05:54:50Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.excel",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.office.excel",
    "appIdentifier": "com.microsoft.office.excel",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.excel&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('ad58470e-d98e-4411-adad-70e3d686ef0e')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "19fd283d-a16c-4e54-9775-7bdd0c26bc22",
    "displayName": "Microsoft Intune",
    "description": "Get access to your organization’s resources and keep them secure.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T18:55:28Z",
    "lastModifiedDateTime": "2025-08-21T10:31:37Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.intune",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.intune",
    "appIdentifier": "com.microsoft.intune",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.intune&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('19fd283d-a16c-4e54-9775-7bdd0c26bc22')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "ba074b3b-b8d0-4aca-8e91-81e5a0fbe795_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "ba074b3b-b8d0-4aca-8e91-81e5a0fbe795"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "ad9c74c7-7ab7-4f74-a99e-ffbada58a7ef",
    "displayName": "Microsoft Launcher",
    "description": "Personalize your phone and stay organized on the go.",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-03-27T02:42:35Z",
    "lastModifiedDateTime": "2025-08-21T10:31:39Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.launcher",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.launcher",
    "appIdentifier": "com.microsoft.launcher",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.launcher&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('ad9c74c7-7ab7-4f74-a99e-ffbada58a7ef')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "38735503-4c10-4f56-a492-ecc5b16bc75a",
    "displayName": "Microsoft Lens - PDF Scanner",
    "description": "Pocket PDF scanner with integrated OCR",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T20:47:49Z",
    "lastModifiedDateTime": "2025-08-21T10:31:37Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.officelens",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.office.officelens",
    "appIdentifier": "com.microsoft.office.officelens",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.officelens&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('38735503-4c10-4f56-a492-ecc5b16bc75a')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "7cc28f93-5536-438f-b1b2-a705e1bc40fe",
    "displayName": "Microsoft Outlook",
    "description": "Recap emails, create drafts and send emails with confidence, now with Copilot",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T20:49:04Z",
    "lastModifiedDateTime": "2025-12-24T21:35:01Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.outlook",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.office.outlook",
    "appIdentifier": "com.microsoft.office.outlook",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.outlook&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('7cc28f93-5536-438f-b1b2-a705e1bc40fe')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.winGetApp",
    "id": "fd3e2e7a-ab01-4e79-8e39-54d14ece51d2",
    "displayName": "Microsoft PowerToys",
    "description": "Microsoft PowerToys is a set of utilities for power users to tune and streamline their Windows experiences for greater productivity. For more info on PowerToys overviews and guides, or any other tools and resources for Windows development environments, head over to docs.microsoft.com!",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-02-04T21:08:46Z",
    "lastModifiedDateTime": "2025-02-04T21:08:46Z",
    "isFeatured": true,
    "privacyInformationUrl": "http://go.microsoft.com/fwlink/?LinkId=521839",
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "manifestHash": null,
    "packageIdentifier": "XP89DCGQ3K6VLD",
    "installExperience": {
      "runAsAccount": "user"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('fd3e2e7a-ab01-4e79-8e39-54d14ece51d2')/microsoft.graph.winGetApp/assignments",
    "assignments": [
      {
        "id": "acacacac-9df4-4c7d-9d50-4ef0226f57a9_0_0",
        "intent": "available",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.winGetAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "f20a6f56-dac2-4ae8-bc49-6d3a75f4662c",
    "displayName": "Microsoft Teams",
    "description": "Chat, meet, call, and collaborate from anywhere, with anyone in one app",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-01-13T20:47:48Z",
    "lastModifiedDateTime": "2025-08-21T10:31:39Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.teams",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.teams",
    "appIdentifier": "com.microsoft.teams",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.teams&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('f20a6f56-dac2-4ae8-bc49-6d3a75f4662c')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "6541d439-af88-4e17-bd9b-1394e867e28f",
    "displayName": "Microsoft Word: Edit Documents",
    "description": "Choose from professionally designed, customizable templates for Word",
    "publisher": "Microsoft Corporation",
    "largeIcon": null,
    "createdDateTime": "2025-02-05T15:10:38Z",
    "lastModifiedDateTime": "2025-12-24T21:35:00Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.word",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.microsoft.office.word",
    "appIdentifier": "com.microsoft.office.word",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.microsoft.office.word&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('6541d439-af88-4e17-bd9b-1394e867e28f')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.win32LobApp",
    "id": "d6964449-26d0-47f4-8917-99d055f67bdd",
    "displayName": "MSTeams-arm64.msix",
    "description": "MSTeams-arm64.msix",
    "publisher": "Microsoft",
    "largeIcon": null,
    "createdDateTime": "2025-09-04T15:31:11Z",
    "lastModifiedDateTime": "2025-09-04T15:31:11Z",
    "isFeatured": false,
    "privacyInformationUrl": "",
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "committedContentVersion": "1",
    "fileName": "MSTeams-arm64.intunewin",
    "size": 225378896,
    "installCommandLine": "powershell.exe -ExecutionPolicy Bypass -Command \"Add-AppxProvisionedPackage -Online -PackagePath MSTeams-arm64.msix -SkipLicense\"",
    "uninstallCommandLine": "powershell.exe -ExecutionPolicy Bypass -Command \"Get-AppxPackage -AllUsers MSTeams | Remove-AppxPackage -AllUsers\"",
    "applicableArchitectures": "none",
    "allowedArchitectures": "arm64",
    "minimumFreeDiskSpaceInMB": null,
    "minimumMemoryInMB": null,
    "minimumNumberOfProcessors": null,
    "minimumCpuSpeedInMHz": null,
    "msiInformation": null,
    "setupFilePath": "MSTeams-arm64.msix",
    "minimumSupportedWindowsRelease": "Windows11_23H2",
    "displayVersion": "",
    "allowAvailableUninstall": true,
    "activeInstallScript": null,
    "activeUninstallScript": null,
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v8_1": false,
      "v10_0": false,
      "v10_1607": false,
      "v10_1703": false,
      "v10_1709": false,
      "v10_1803": false,
      "v10_1809": false,
      "v10_1903": false,
      "v10_1909": false,
      "v10_2004": false,
      "v10_2H20": false,
      "v10_21H1": false
    },
    "detectionRules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppPowerShellScriptDetection",
        "enforceSignatureCheck": false,
        "runAs32Bit": false,
        "scriptContent": "JHBhdGggPSAiQzpcUHJvZ3JhbSBGaWxlc1xXaW5kb3dzQXBwcyINCiRmb3VuZCA9IEdldC1DaGlsZEl0ZW0gJHBhdGggLURpcmVjdG9yeSAtRXJyb3JBY3Rpb24gU2lsZW50bHlDb250aW51ZSB8IFdoZXJlLU9iamVjdCB7ICRfLk5hbWUgLW1hdGNoICJeTVNUZWFtc18iIH0NCg0KaWYgKCRmb3VuZCkgew0KICAgIFdyaXRlLU91dHB1dCAiRGV0ZWN0ZWQgVGVhbXM6ICQoJGZvdW5kLk5hbWUpIg0KICAgIGV4aXQgMA0KfQ0KZWxzZSB7DQogICAgZXhpdCAxDQp9DQo="
      }
    ],
    "requirementRules": [],
    "rules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppPowerShellScriptRule",
        "ruleType": "detection",
        "displayName": null,
        "enforceSignatureCheck": false,
        "runAs32Bit": false,
        "runAsAccount": null,
        "scriptContent": "JHBhdGggPSAiQzpcUHJvZ3JhbSBGaWxlc1xXaW5kb3dzQXBwcyINCiRmb3VuZCA9IEdldC1DaGlsZEl0ZW0gJHBhdGggLURpcmVjdG9yeSAtRXJyb3JBY3Rpb24gU2lsZW50bHlDb250aW51ZSB8IFdoZXJlLU9iamVjdCB7ICRfLk5hbWUgLW1hdGNoICJeTVNUZWFtc18iIH0NCg0KaWYgKCRmb3VuZCkgew0KICAgIFdyaXRlLU91dHB1dCAiRGV0ZWN0ZWQgVGVhbXM6ICQoJGZvdW5kLk5hbWUpIg0KICAgIGV4aXQgMA0KfQ0KZWxzZSB7DQogICAgZXhpdCAxDQp9DQo=",
        "operationType": "notConfigured",
        "operator": "notConfigured",
        "comparisonValue": null
      }
    ],
    "installExperience": {
      "runAsAccount": "system",
      "maxRunTimeInMinutes": 60,
      "deviceRestartBehavior": "allow"
    },
    "returnCodes": [
      {
        "returnCode": 0,
        "type": "success"
      },
      {
        "returnCode": 1707,
        "type": "success"
      },
      {
        "returnCode": 3010,
        "type": "softReboot"
      },
      {
        "returnCode": 1641,
        "type": "hardReboot"
      },
      {
        "returnCode": 1618,
        "type": "retry"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('d6964449-26d0-47f4-8917-99d055f67bdd')/microsoft.graph.win32LobApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.win32LobApp",
    "id": "a7564812-9dd2-4ba8-ac71-1289191a9bda",
    "displayName": "Notepad++",
    "description": "Notepad++",
    "publisher": "Notepad++",
    "largeIcon": null,
    "createdDateTime": "2025-07-04T03:28:30Z",
    "lastModifiedDateTime": "2025-07-04T03:28:30Z",
    "isFeatured": true,
    "privacyInformationUrl": "",
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 1,
    "committedContentVersion": "1",
    "fileName": "npp.8.8.2.Installer.x64.intunewin",
    "size": 6714144,
    "installCommandLine": "npp.8.8.2.Installer.x64.exe /S",
    "uninstallCommandLine": "C:\\Program Files (x86)\\Notepad++\\uninstall.exe /S",
    "applicableArchitectures": "x86,x64",
    "allowedArchitectures": null,
    "minimumFreeDiskSpaceInMB": null,
    "minimumMemoryInMB": null,
    "minimumNumberOfProcessors": null,
    "minimumCpuSpeedInMHz": null,
    "msiInformation": null,
    "setupFilePath": "npp.8.8.2.Installer.x64.exe",
    "minimumSupportedWindowsRelease": "Windows11_21H2",
    "displayVersion": "8.8.2",
    "allowAvailableUninstall": true,
    "activeInstallScript": null,
    "activeUninstallScript": null,
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v8_1": false,
      "v10_0": false,
      "v10_1607": false,
      "v10_1703": false,
      "v10_1709": false,
      "v10_1803": false,
      "v10_1809": false,
      "v10_1903": false,
      "v10_1909": false,
      "v10_2004": false,
      "v10_2H20": false,
      "v10_21H1": false
    },
    "detectionRules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppFileSystemDetection",
        "path": "C:\\Program Files (x86)\\Notepad++\\",
        "fileOrFolderName": "uninstall.exe",
        "check32BitOn64System": false,
        "detectionType": "exists",
        "operator": "notConfigured",
        "detectionValue": null
      }
    ],
    "requirementRules": [],
    "rules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppFileSystemRule",
        "ruleType": "detection",
        "path": "C:\\Program Files (x86)\\Notepad++\\",
        "fileOrFolderName": "uninstall.exe",
        "check32BitOn64System": false,
        "operationType": "exists",
        "operator": "notConfigured",
        "comparisonValue": null
      }
    ],
    "installExperience": {
      "runAsAccount": "system",
      "maxRunTimeInMinutes": 60,
      "deviceRestartBehavior": "allow"
    },
    "returnCodes": [
      {
        "returnCode": 0,
        "type": "success"
      },
      {
        "returnCode": 1707,
        "type": "success"
      },
      {
        "returnCode": 3010,
        "type": "softReboot"
      },
      {
        "returnCode": 1641,
        "type": "hardReboot"
      },
      {
        "returnCode": 1618,
        "type": "retry"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('a7564812-9dd2-4ba8-ac71-1289191a9bda')/microsoft.graph.win32LobApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.win32LobApp",
    "id": "a33b0fe2-ad79-437c-a60d-e97ef08852fe",
    "displayName": "Notepad++",
    "description": "Notepad++",
    "publisher": "Notepad++",
    "largeIcon": null,
    "createdDateTime": "2025-06-18T00:43:53Z",
    "lastModifiedDateTime": "2025-07-04T03:30:55Z",
    "isFeatured": true,
    "privacyInformationUrl": null,
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 1,
    "supersededAppCount": 0,
    "committedContentVersion": "1",
    "fileName": "npp.8.8.1.Installer.x64.intunewin",
    "size": 6737712,
    "installCommandLine": "npp.8.8.1.Installer.x64.exe /S",
    "uninstallCommandLine": "C:\\Program Files (x86)\\Notepad++\\uninstall.exe /S",
    "applicableArchitectures": "none",
    "allowedArchitectures": null,
    "minimumFreeDiskSpaceInMB": null,
    "minimumMemoryInMB": null,
    "minimumNumberOfProcessors": null,
    "minimumCpuSpeedInMHz": null,
    "msiInformation": null,
    "setupFilePath": "npp.8.8.1.Installer.x64.exe",
    "minimumSupportedWindowsRelease": "Windows11_21H2",
    "displayVersion": "8.8.1",
    "allowAvailableUninstall": true,
    "activeInstallScript": null,
    "activeUninstallScript": null,
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v8_1": false,
      "v10_0": false,
      "v10_1607": false,
      "v10_1703": false,
      "v10_1709": false,
      "v10_1803": false,
      "v10_1809": false,
      "v10_1903": false,
      "v10_1909": false,
      "v10_2004": false,
      "v10_2H20": false,
      "v10_21H1": false
    },
    "detectionRules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppFileSystemDetection",
        "path": "C:\\Program Files (x86)\\Notepad++\\",
        "fileOrFolderName": "uninstall.exe",
        "check32BitOn64System": false,
        "detectionType": "exists",
        "operator": "notConfigured",
        "detectionValue": null
      }
    ],
    "requirementRules": [],
    "rules": [
      {
        "@odata.type": "#microsoft.graph.win32LobAppFileSystemRule",
        "ruleType": "detection",
        "path": "C:\\Program Files (x86)\\Notepad++\\",
        "fileOrFolderName": "uninstall.exe",
        "check32BitOn64System": false,
        "operationType": "exists",
        "operator": "notConfigured",
        "comparisonValue": null
      }
    ],
    "installExperience": {
      "runAsAccount": "system",
      "maxRunTimeInMinutes": 60,
      "deviceRestartBehavior": "allow"
    },
    "returnCodes": [
      {
        "returnCode": 0,
        "type": "success"
      },
      {
        "returnCode": 1707,
        "type": "success"
      },
      {
        "returnCode": 3010,
        "type": "softReboot"
      },
      {
        "returnCode": 1641,
        "type": "hardReboot"
      },
      {
        "returnCode": 1618,
        "type": "retry"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('a33b0fe2-ad79-437c-a60d-e97ef08852fe')/microsoft.graph.win32LobApp/assignments",
    "assignments": [
      {
        "id": "247c3463-4aa7-4d07-afe6-3def144ba810_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "247c3463-4aa7-4d07-afe6-3def144ba810"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.win32LobAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null,
          "deliveryOptimizationPriority": "notConfigured",
          "autoUpdateSettings": null
        }
      },
      {
        "id": "68faab98-774e-41ee-87df-1aebd1ebb787_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "68faab98-774e-41ee-87df-1aebd1ebb787"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.win32LobAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null,
          "deliveryOptimizationPriority": "notConfigured",
          "autoUpdateSettings": null
        }
      },
      {
        "id": "277aae45-b2c5-49dd-9ff1-fa07148d0feb_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "277aae45-b2c5-49dd-9ff1-fa07148d0feb"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.win32LobAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null,
          "deliveryOptimizationPriority": "notConfigured",
          "autoUpdateSettings": null
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.managedIOSLobApp",
    "id": "9bdda3ca-4ee6-4ecd-8b39-c539965a9df6",
    "displayName": "PatientKeeper",
    "description": "PatientKeeper",
    "publisher": "OptumCare",
    "largeIcon": null,
    "createdDateTime": "2025-03-24T18:23:06Z",
    "lastModifiedDateTime": "2025-09-09T19:50:39Z",
    "isFeatured": false,
    "privacyInformationUrl": "",
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "appAvailability": "lineOfBusiness",
    "version": null,
    "committedContentVersion": "1",
    "fileName": "iOS Wrapped IPA_2025.1.ipa",
    "size": 21462368,
    "bundleId": "com.patientkeeper.pk9",
    "expirationDateTime": "2025-04-26T09:21:59Z",
    "versionNumber": "2025.1",
    "buildNumber": "658820149.3.2",
    "identityVersion": "658820149.3.2",
    "applicableDeviceType": {
      "iPad": true,
      "iPhoneAndIPod": true
    },
    "minimumSupportedOperatingSystem": {
      "v8_0": false,
      "v9_0": false,
      "v10_0": false,
      "v11_0": false,
      "v12_0": false,
      "v13_0": false,
      "v14_0": false,
      "v15_0": true,
      "v16_0": false,
      "v17_0": false,
      "v18_0": false,
      "v26_0": false
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('9bdda3ca-4ee6-4ecd-8b39-c539965a9df6')/microsoft.graph.managedIOSLobApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "af4ad0a2-6fcc-4342-9329-aed0e28ccda6",
    "displayName": "TD Authenticate",
    "description": "Use the TD Authenticate™ app to securely complete Two-Step Verification.",
    "publisher": "TD Bank Group",
    "largeIcon": null,
    "createdDateTime": "2025-06-18T16:37:29Z",
    "lastModifiedDateTime": "2025-08-21T10:31:40Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.td.softtoken",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.td.softtoken",
    "appIdentifier": "com.td.softtoken",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.td.softtoken&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('af4ad0a2-6fcc-4342-9329-aed0e28ccda6')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "fc3be576-b55b-437d-b126-c3219012101a",
    "displayName": "TD Bank (US)",
    "description": "Everyday banking, all in one app.",
    "publisher": "TD Bank, N.A.",
    "largeIcon": null,
    "createdDateTime": "2025-06-18T16:36:50Z",
    "lastModifiedDateTime": "2025-12-03T13:22:45Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.tdbank",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.tdbank",
    "appIdentifier": "com.tdbank",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.tdbank&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('fc3be576-b55b-437d-b126-c3219012101a')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "0a1e2481-741b-443b-9e10-6748ee8b6154",
    "displayName": "TD Canada",
    "description": "Everyday banking, trading, and rewards. All in one app.",
    "publisher": "TD Bank Group",
    "largeIcon": null,
    "createdDateTime": "2025-06-18T16:37:29Z",
    "lastModifiedDateTime": "2025-08-21T10:31:39Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.td",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.td",
    "appIdentifier": "com.td",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.td&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('0a1e2481-741b-443b-9e10-6748ee8b6154')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": [
      {
        "id": "adadadad-808e-44e2-905a-0b7873a8a531_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      },
      {
        "id": "acacacac-9df4-4c7d-9d50-4ef0226f57a9_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.androidManagedStoreAppAssignmentSettings",
          "androidManagedStoreAppTrackIds": [],
          "autoUpdateMode": "default"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.winGetApp",
    "id": "08105020-c237-4ad1-8d05-473838e39d5d",
    "displayName": "TreeSize Free",
    "description": "You open the Windows Explorer to check on your hard drives and all you see is red? There was room on your hard disk yesterday, but today it is gone? There is help! \n\nThe disk space manager TreeSize Free tells you where precious disk space has gone. \n\n- Visualize disk space usage with the treemap chart.\n- Gain in-depth information in the column view.\n- Filter scan results and break down information to better clean up your hard disk.\n- Scan smartphones and mobile devices connected to you PC.\n- Scan network drives (not in Windows domains / on Windows Server) and locally synchronized cloud shares.\n- See the NTFS compression rate and apply NTFS compression to directory branches.\n- Use the touch interface on touchscreen devices.\n\nThe lightweight app TreeSize Free works directly on the Master File Table (MFT) and reaches extremely high scan speeds.\n\nA portable ZIP file enables users to install TreeSize Free on a USB stick. More information is available at\nhttps://www.jam-software.com/treesize_free/\n\nNote: This app requires admin privileges for the installation. The application itself can be run without elevated privileges.",
    "publisher": "JAM Software",
    "largeIcon": null,
    "createdDateTime": "2025-02-04T19:37:59Z",
    "lastModifiedDateTime": "2025-05-17T15:20:46Z",
    "isFeatured": true,
    "privacyInformationUrl": "https://www.jam-software.com/company/privacy.shtml",
    "informationUrl": null,
    "owner": "",
    "developer": "",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "manifestHash": null,
    "packageIdentifier": "XP9M26RSCLNT88",
    "installExperience": {
      "runAsAccount": "system"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('08105020-c237-4ad1-8d05-473838e39d5d')/microsoft.graph.winGetApp/assignments",
    "assignments": [
      {
        "id": "6cbb88a2-8772-441d-88e6-90e2a2e16b07_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "6cbb88a2-8772-441d-88e6-90e2a2e16b07"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.winGetAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null
        }
      },
      {
        "id": "247c3463-4aa7-4d07-afe6-3def144ba810_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "247c3463-4aa7-4d07-afe6-3def144ba810"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.winGetAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null
        }
      },
      {
        "id": "277aae45-b2c5-49dd-9ff1-fa07148d0feb_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "277aae45-b2c5-49dd-9ff1-fa07148d0feb"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.winGetAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null
        }
      },
      {
        "id": "68faab98-774e-41ee-87df-1aebd1ebb787_1_0",
        "intent": "required",
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "68faab98-774e-41ee-87df-1aebd1ebb787"
        },
        "settings": {
          "@odata.type": "#microsoft.graph.winGetAppAssignmentSettings",
          "notifications": "showAll",
          "restartSettings": null,
          "installTimeSettings": null
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.officeSuiteApp",
    "id": "21a968f0-2c20-4ce3-80f2-aaafd102d187",
    "displayName": "Visio",
    "description": "Visio X64",
    "publisher": "Microsoft",
    "largeIcon": null,
    "createdDateTime": "2025-05-17T14:30:36Z",
    "lastModifiedDateTime": "2025-05-17T14:30:36Z",
    "isFeatured": true,
    "privacyInformationUrl": "https://privacy.microsoft.com/privacystatement",
    "informationUrl": "https://products.office.com/explore-office-for-home",
    "owner": "Microsoft",
    "developer": "Microsoft",
    "notes": "",
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": true,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "autoAcceptEula": false,
    "productIds": [],
    "excludedApps": null,
    "useSharedComputerActivation": false,
    "updateChannel": "none",
    "officeSuiteAppDefaultFileFormat": "notConfigured",
    "officePlatformArchitecture": "none",
    "localesToInstall": [],
    "installProgressDisplayLevel": "none",
    "shouldUninstallOlderVersionsOfOffice": false,
    "targetVersion": null,
    "updateVersion": null,
    "officeConfigurationXml": "PENvbmZpZ3VyYXRpb24+CjxBZGQgVmVyc2lvbj0iTWF0Y2hJbnN0YWxsZWQiPgo8UHJvZHVjdCBJRD0iVmlzaW9Qcm9SZXRhaWwiPgo8TGFuZ3VhZ2UgSUQ9Ik1hdGNoT1MiLz4KPEV4Y2x1ZGVBcHAgSUQ9Ikdyb292ZSIvPgo8RXhjbHVkZUFwcCBJRD0iT25lRHJpdmUiLz4KPC9Qcm9kdWN0Pgo8L0FkZD4KPFByb3BlcnR5IE5hbWU9IlNoYXJlZENvbXB1dGVyTGljZW5zaW5nIiBWYWx1ZT0iMCIvPgo8UHJvcGVydHkgTmFtZT0iRk9SQ0VBUFBTSFVURE9XTiIgVmFsdWU9IlRSVUUiLz4KPFByb3BlcnR5IE5hbWU9IkRldmljZUJhc2VkTGljZW5zaW5nIiBWYWx1ZT0iMCIvPgo8UHJvcGVydHkgTmFtZT0iU0NMQ2FjaGVPdmVycmlkZSIgVmFsdWU9IjAiLz4KPFByb3BlcnR5IE5hbWU9IlRlbmFudElkIiBWYWx1ZT0iWW91ciB0ZW5hbnQgaWQiLz4KPFVwZGF0ZXMgRW5hYmxlZD0iVFJVRSIvPgo8L0NvbmZpZ3VyYXRpb24+",
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('21a968f0-2c20-4ce3-80f2-aaafd102d187')/microsoft.graph.officeSuiteApp/assignments",
    "assignments": [
      {
        "id": "acacacac-9df4-4c7d-9d50-4ef0226f57a9_0_0",
        "intent": "available",
        "settings": null,
        "source": "direct",
        "sourceId": null,
        "target": {
          "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "8b70c5b5-0bef-46e7-b680-fa8222d45e1d",
    "displayName": "WeCom",
    "description": "WeCom, Offering Every Enterprise their own WeChat",
    "publisher": "Tencent Technology (Shenzhen) Company Ltd.",
    "largeIcon": null,
    "createdDateTime": "2025-08-13T14:54:46Z",
    "lastModifiedDateTime": "2025-08-21T10:31:38Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.tencent.wework",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.tencent.wework",
    "appIdentifier": "com.tencent.wework",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.tencent.wework&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('8b70c5b5-0bef-46e7-b680-fa8222d45e1d')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidManagedStoreApp",
    "id": "6286ddc8-7f5c-4fa9-a660-c83c1c8f3f79",
    "displayName": "WhatsApp Messenger",
    "description": "Simple. Reliable. Private.",
    "publisher": "WhatsApp LLC",
    "largeIcon": null,
    "createdDateTime": "2025-02-04T20:30:36Z",
    "lastModifiedDateTime": "2025-08-21T10:31:39Z",
    "isFeatured": false,
    "privacyInformationUrl": null,
    "informationUrl": "https://play.google.com/store/apps/details?id=com.whatsapp",
    "owner": null,
    "developer": null,
    "notes": null,
    "uploadState": 1,
    "publishingState": "published",
    "isAssigned": false,
    "roleScopeTagIds": [],
    "dependentAppCount": 0,
    "supersedingAppCount": 0,
    "supersededAppCount": 0,
    "packageId": "com.whatsapp",
    "appIdentifier": "com.whatsapp",
    "usedLicenseCount": 0,
    "totalLicenseCount": 0,
    "appStoreUrl": "https://play.google.com/store/apps/details?id=com.whatsapp&hl=en-US",
    "isPrivate": false,
    "isSystemApp": false,
    "supportsOemConfig": false,
    "appTracks": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceAppManagement/mobileApps('6286ddc8-7f5c-4fa9-a660-c83c1c8f3f79')/microsoft.graph.androidManagedStoreApp/assignments",
    "assignments": []
  }
]
