[
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerVpnConfiguration",
    "id": "71034b29-ed9e-43f8-86ca-b734da48fba1",
    "lastModifiedDateTime": "2025-01-16T18:36:19.3129466Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-01-16T18:36:19.3129466Z",
    "description": null,
    "displayName": "AE WP Per App Tunnel1",
    "version": 2,
    "authenticationMethod": "azureAD",
    "connectionName": "Tunnel 1",
    "role": null,
    "realm": null,
    "connectionType": "microsoftProtect",
    "proxyServer": null,
    "targetedPackageIds": [
      "com.microsoft.emmx"
    ],
    "alwaysOn": true,
    "alwaysOnLockdown": null,
    "microsoftTunnelSiteId": "133b58b7-b294-4aa9-8da7-7c4ae62a4cd4",
    "proxyExclusionList": [],
    "servers": [
      {
        "description": "LETSINTUNE – Tunnel Canada",
        "address": "mam-tun-1.letsintune.com:443",
        "isDefaultServer": true
      }
    ],
    "targetedMobileApps": [
      {
        "name": "Microsoft Edge: AI browser",
        "publisher": "Microsoft Corporation",
        "appStoreUrl": null,
        "appId": "com.microsoft.emmx"
      }
    ],
    "customData": [
      {
        "key": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "customKeyValueData": [
      {
        "name": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('71034b29-ed9e-43f8-86ca-b734da48fba1')/microsoft.graph.androidDeviceOwnerVpnConfiguration/assignments",
    "assignments": [
      {
        "id": "71034b29-ed9e-43f8-86ca-b734da48fba1_05d1fa77-8911-490d-a024-69c32110ec85",
        "source": "direct",
        "sourceId": "71034b29-ed9e-43f8-86ca-b734da48fba1",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "05d1fa77-8911-490d-a024-69c32110ec85"
        }
      },
      {
        "id": "71034b29-ed9e-43f8-86ca-b734da48fba1_c1d87505-abbd-481e-99d1-a58738623e67",
        "source": "direct",
        "sourceId": "71034b29-ed9e-43f8-86ca-b734da48fba1",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.exclusionGroupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "c1d87505-abbd-481e-99d1-a58738623e67"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerVpnConfiguration",
    "id": "087d4f33-dd51-4c07-aae5-e1d8d3a478c1",
    "lastModifiedDateTime": "2025-01-17T01:27:29.6784161Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-01-15T06:26:45.7886389Z",
    "description": null,
    "displayName": "AE WP Per App Tunnel2",
    "version": 7,
    "authenticationMethod": "azureAD",
    "connectionName": "Tunnel 2",
    "role": null,
    "realm": null,
    "connectionType": "microsoftProtect",
    "proxyServer": null,
    "targetedPackageIds": [
      "com.microsoft.emmx"
    ],
    "alwaysOn": true,
    "alwaysOnLockdown": null,
    "microsoftTunnelSiteId": "c4c07796-aa62-4926-84d2-4a46fde268ea",
    "proxyExclusionList": [],
    "servers": [
      {
        "description": "Site 2",
        "address": "mam-tun-2.letsintune.com:443",
        "isDefaultServer": true
      }
    ],
    "targetedMobileApps": [
      {
        "name": "Microsoft Edge: AI browser",
        "publisher": "Microsoft Corporation",
        "appStoreUrl": null,
        "appId": "com.microsoft.emmx"
      }
    ],
    "customData": [
      {
        "key": "MicrosoftDefenderAppSettings",
        "value": "null"
      }
    ],
    "customKeyValueData": [
      {
        "name": "MicrosoftDefenderAppSettings",
        "value": "null"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('087d4f33-dd51-4c07-aae5-e1d8d3a478c1')/microsoft.graph.androidDeviceOwnerVpnConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidWorkProfileVpnConfiguration",
    "id": "84d9004f-f78e-4dcc-901b-52e0e3dd4562",
    "lastModifiedDateTime": "2025-08-06T17:58:53.0994555Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-06T17:58:53.0994555Z",
    "description": null,
    "displayName": "AE WP Per App Tunnel4",
    "version": 1,
    "connectionName": "AE WP Per App Tunnel4",
    "connectionType": "microsoftProtect",
    "role": null,
    "realm": null,
    "fingerprint": null,
    "authenticationMethod": "azureAD",
    "proxyServer": null,
    "targetedPackageIds": [
      "com.microsoft.emmx"
    ],
    "alwaysOn": true,
    "alwaysOnLockdown": null,
    "microsoftTunnelSiteId": "c4c07796-aa62-4926-84d2-4a46fde268ea",
    "proxyExclusionList": [],
    "servers": [
      {
        "description": "Site 2",
        "address": "mam-tun-2.letsintune.com:443",
        "isDefaultServer": true
      }
    ],
    "customData": [
      {
        "key": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "customKeyValueData": [
      {
        "name": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "targetedMobileApps": [
      {
        "name": "Microsoft Edge: AI browser",
        "publisher": "Microsoft Corporation",
        "appStoreUrl": null,
        "appId": "com.microsoft.emmx"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('84d9004f-f78e-4dcc-901b-52e0e3dd4562')/microsoft.graph.androidWorkProfileVpnConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "id": "a7e1f6ac-e67d-4b40-8a5a-3e560027fee4",
    "lastModifiedDateTime": "2025-09-19T13:22:02.8889946Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-09-09T13:41:51.9182136Z",
    "description": "prevent microphone use on Android devices",
    "displayName": "Android Enterprise",
    "version": 2,
    "accountsBlockModification": null,
    "appsAllowInstallFromUnknownSources": null,
    "appsAutoUpdatePolicy": null,
    "appsDefaultPermissionPolicy": null,
    "appsRecommendSkippingFirstUseHints": null,
    "bluetoothBlockConfiguration": null,
    "bluetoothBlockContactSharing": null,
    "cameraBlocked": false,
    "cellularBlockWiFiTethering": null,
    "certificateCredentialConfigurationDisabled": null,
    "crossProfilePoliciesAllowCopyPaste": null,
    "crossProfilePoliciesAllowDataSharing": "notConfigured",
    "crossProfilePoliciesShowWorkContactsInPersonalProfile": null,
    "microsoftLauncherConfigurationEnabled": null,
    "microsoftLauncherCustomWallpaperEnabled": null,
    "microsoftLauncherCustomWallpaperImageUrl": null,
    "microsoftLauncherCustomWallpaperAllowUserModification": null,
    "microsoftLauncherFeedEnabled": null,
    "microsoftLauncherFeedAllowUserModification": null,
    "microsoftLauncherDockPresenceConfiguration": null,
    "microsoftLauncherDockPresenceAllowUserModification": null,
    "microsoftLauncherSearchBarPlacementConfiguration": null,
    "enrollmentProfile": "notConfigured",
    "dataRoamingBlocked": null,
    "dateTimeConfigurationBlocked": null,
    "detailedHelpText": null,
    "deviceOwnerLockScreenMessage": null,
    "securityCommonCriteriaModeEnabled": null,
    "factoryResetDeviceAdministratorEmails": [],
    "factoryResetBlocked": null,
    "globalProxy": null,
    "googleAccountsBlocked": null,
    "kioskCustomizationDeviceSettingsBlocked": null,
    "kioskCustomizationPowerButtonActionsBlocked": null,
    "kioskCustomizationStatusBar": "notConfigured",
    "kioskCustomizationSystemErrorWarnings": null,
    "kioskCustomizationSystemNavigation": "notConfigured",
    "kioskModeScreenSaverConfigurationEnabled": null,
    "kioskModeScreenSaverImageUrl": null,
    "kioskModeScreenSaverDisplayTimeInSeconds": null,
    "kioskModeScreenSaverStartDelayInSeconds": null,
    "kioskModeScreenSaverDetectMediaDisabled": null,
    "kioskModeWallpaperUrl": null,
    "kioskModeExitCode": null,
    "kioskModeVirtualHomeButtonEnabled": null,
    "kioskModeVirtualHomeButtonType": null,
    "kioskModeBluetoothConfigurationEnabled": null,
    "kioskModeWiFiConfigurationEnabled": null,
    "kioskModeFlashlightConfigurationEnabled": null,
    "kioskModeMediaVolumeConfigurationEnabled": null,
    "kioskModeShowDeviceInfo": null,
    "kioskModeManagedSettingsEntryDisabled": null,
    "kioskModeDebugMenuEasyAccessEnabled": null,
    "kioskModeShowAppNotificationBadge": null,
    "kioskModeScreenOrientation": null,
    "kioskModeIconSize": null,
    "kioskModeFolderIcon": null,
    "kioskModeWifiAllowedSsids": [],
    "kioskModeAppOrderEnabled": null,
    "kioskModeAppsInFolderOrderedByName": null,
    "kioskModeGridHeight": null,
    "kioskModeGridWidth": null,
    "kioskModeLockHomeScreen": null,
    "kioskModeManagedHomeScreenAutoSignout": null,
    "kioskModeManagedHomeScreenInactiveSignOutDelayInSeconds": null,
    "kioskModeManagedHomeScreenInactiveSignOutNoticeInSeconds": null,
    "kioskModeManagedHomeScreenPinComplexity": null,
    "kioskModeManagedHomeScreenPinRequired": null,
    "kioskModeManagedHomeScreenPinRequiredToResume": null,
    "kioskModeManagedHomeScreenSignInBackground": null,
    "kioskModeManagedHomeScreenSignInBrandingLogo": null,
    "kioskModeManagedHomeScreenSignInEnabled": null,
    "kioskModeUseManagedHomeScreenApp": "notConfigured",
    "microphoneForceMute": false,
    "networkEscapeHatchAllowed": null,
    "nfcBlockOutgoingBeam": null,
    "passwordBlockKeyguard": null,
    "passwordBlockKeyguardFeatures": [],
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinimumLetterCharacters": null,
    "passwordMinimumLowerCaseCharacters": null,
    "passwordMinimumNonLetterCharacters": null,
    "passwordMinimumNumericCharacters": null,
    "passwordMinimumSymbolCharacters": null,
    "passwordMinimumUpperCaseCharacters": null,
    "passwordMinutesOfInactivityBeforeScreenTimeout": null,
    "passwordPreviousPasswordCountToBlock": null,
    "passwordRequiredType": "deviceDefault",
    "passwordRequireUnlock": "deviceDefault",
    "passwordSignInFailureCountBeforeFactoryReset": null,
    "playStoreMode": null,
    "screenCaptureBlocked": false,
    "securityDeveloperSettingsEnabled": null,
    "securityRequireVerifyApps": true,
    "shortHelpText": null,
    "statusBarBlocked": null,
    "stayOnModes": [],
    "storageAllowUsb": null,
    "storageBlockExternalMedia": null,
    "storageBlockUsbFileTransfer": null,
    "systemUpdateWindowStartMinutesAfterMidnight": null,
    "systemUpdateWindowEndMinutesAfterMidnight": null,
    "systemUpdateInstallType": null,
    "systemWindowsBlocked": null,
    "usersBlockAdd": null,
    "usersBlockRemove": null,
    "volumeBlockAdjustment": false,
    "vpnAlwaysOnLockdownMode": false,
    "vpnAlwaysOnPackageIdentifier": "",
    "wifiBlockEditConfigurations": null,
    "wifiBlockEditPolicyDefinedConfigurations": null,
    "personalProfileAppsAllowInstallFromUnknownSources": null,
    "personalProfileCameraBlocked": false,
    "personalProfileScreenCaptureBlocked": false,
    "personalProfilePlayStoreMode": "notConfigured",
    "workProfilePasswordExpirationDays": null,
    "workProfilePasswordMinimumLength": null,
    "workProfilePasswordMinimumNumericCharacters": null,
    "workProfilePasswordMinimumNonLetterCharacters": null,
    "workProfilePasswordMinimumLetterCharacters": null,
    "workProfilePasswordMinimumLowerCaseCharacters": null,
    "workProfilePasswordMinimumUpperCaseCharacters": null,
    "workProfilePasswordMinimumSymbolCharacters": null,
    "workProfilePasswordPreviousPasswordCountToBlock": null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset": null,
    "workProfilePasswordRequiredType": "deviceDefault",
    "workProfilePasswordRequireUnlock": "deviceDefault",
    "locateDeviceUserlessDisabled": null,
    "locateDeviceLostModeEnabled": null,
    "shareDeviceLocationDisabled": null,
    "deviceLocationMode": "notConfigured",
    "azureAdSharedDeviceDataClearApps": [],
    "kioskModeApps": [],
    "kioskModeManagedFolders": [],
    "kioskModeAppPositions": [],
    "kioskModeManagedHomeScreenAppSettings": [],
    "systemUpdateFreezePeriods": [],
    "personalProfilePersonalApplications": [],
    "androidDeviceOwnerDelegatedScopeAppSettings": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('a7e1f6ac-e67d-4b40-8a5a-3e560027fee4')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments",
    "assignments": [
      {
        "id": "a7e1f6ac-e67d-4b40-8a5a-3e560027fee4_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "a7e1f6ac-e67d-4b40-8a5a-3e560027fee4",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "id": "372ad8f7-5eef-4586-96ba-2f32d6211176",
    "lastModifiedDateTime": "2025-05-13T17:14:30.7166317Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-05-12T13:38:09.6164737Z",
    "description": null,
    "displayName": "Android_corp Restriction Policy",
    "version": 3,
    "accountsBlockModification": true,
    "appsAllowInstallFromUnknownSources": null,
    "appsAutoUpdatePolicy": "always",
    "appsDefaultPermissionPolicy": "autoGrant",
    "appsRecommendSkippingFirstUseHints": null,
    "bluetoothBlockConfiguration": null,
    "bluetoothBlockContactSharing": true,
    "cameraBlocked": null,
    "cellularBlockWiFiTethering": null,
    "certificateCredentialConfigurationDisabled": true,
    "crossProfilePoliciesAllowCopyPaste": null,
    "crossProfilePoliciesAllowDataSharing": "dataSharingFromWorkToPersonalBlocked",
    "crossProfilePoliciesShowWorkContactsInPersonalProfile": false,
    "microsoftLauncherConfigurationEnabled": null,
    "microsoftLauncherCustomWallpaperEnabled": null,
    "microsoftLauncherCustomWallpaperImageUrl": null,
    "microsoftLauncherCustomWallpaperAllowUserModification": null,
    "microsoftLauncherFeedEnabled": null,
    "microsoftLauncherFeedAllowUserModification": null,
    "microsoftLauncherDockPresenceConfiguration": null,
    "microsoftLauncherDockPresenceAllowUserModification": null,
    "microsoftLauncherSearchBarPlacementConfiguration": null,
    "enrollmentProfile": "notConfigured",
    "dataRoamingBlocked": null,
    "dateTimeConfigurationBlocked": true,
    "detailedHelpText": null,
    "deviceOwnerLockScreenMessage": null,
    "securityCommonCriteriaModeEnabled": true,
    "factoryResetDeviceAdministratorEmails": [],
    "factoryResetBlocked": null,
    "globalProxy": null,
    "googleAccountsBlocked": true,
    "kioskCustomizationDeviceSettingsBlocked": null,
    "kioskCustomizationPowerButtonActionsBlocked": null,
    "kioskCustomizationStatusBar": "notConfigured",
    "kioskCustomizationSystemErrorWarnings": null,
    "kioskCustomizationSystemNavigation": "notConfigured",
    "kioskModeScreenSaverConfigurationEnabled": null,
    "kioskModeScreenSaverImageUrl": null,
    "kioskModeScreenSaverDisplayTimeInSeconds": null,
    "kioskModeScreenSaverStartDelayInSeconds": null,
    "kioskModeScreenSaverDetectMediaDisabled": null,
    "kioskModeWallpaperUrl": null,
    "kioskModeExitCode": null,
    "kioskModeVirtualHomeButtonEnabled": null,
    "kioskModeVirtualHomeButtonType": null,
    "kioskModeBluetoothConfigurationEnabled": null,
    "kioskModeWiFiConfigurationEnabled": null,
    "kioskModeFlashlightConfigurationEnabled": null,
    "kioskModeMediaVolumeConfigurationEnabled": null,
    "kioskModeShowDeviceInfo": null,
    "kioskModeManagedSettingsEntryDisabled": null,
    "kioskModeDebugMenuEasyAccessEnabled": null,
    "kioskModeShowAppNotificationBadge": null,
    "kioskModeScreenOrientation": null,
    "kioskModeIconSize": null,
    "kioskModeFolderIcon": null,
    "kioskModeWifiAllowedSsids": [],
    "kioskModeAppOrderEnabled": null,
    "kioskModeAppsInFolderOrderedByName": null,
    "kioskModeGridHeight": null,
    "kioskModeGridWidth": null,
    "kioskModeLockHomeScreen": null,
    "kioskModeManagedHomeScreenAutoSignout": null,
    "kioskModeManagedHomeScreenInactiveSignOutDelayInSeconds": null,
    "kioskModeManagedHomeScreenInactiveSignOutNoticeInSeconds": null,
    "kioskModeManagedHomeScreenPinComplexity": null,
    "kioskModeManagedHomeScreenPinRequired": null,
    "kioskModeManagedHomeScreenPinRequiredToResume": null,
    "kioskModeManagedHomeScreenSignInBackground": null,
    "kioskModeManagedHomeScreenSignInBrandingLogo": null,
    "kioskModeManagedHomeScreenSignInEnabled": null,
    "kioskModeUseManagedHomeScreenApp": "notConfigured",
    "microphoneForceMute": null,
    "networkEscapeHatchAllowed": true,
    "nfcBlockOutgoingBeam": true,
    "passwordBlockKeyguard": null,
    "passwordBlockKeyguardFeatures": [
      "camera",
      "iris",
      "remoteInput",
      "trustAgents",
      "unredactedNotifications"
    ],
    "passwordExpirationDays": 120,
    "passwordMinimumLength": 8,
    "passwordMinimumLetterCharacters": null,
    "passwordMinimumLowerCaseCharacters": null,
    "passwordMinimumNonLetterCharacters": null,
    "passwordMinimumNumericCharacters": null,
    "passwordMinimumSymbolCharacters": null,
    "passwordMinimumUpperCaseCharacters": null,
    "passwordMinutesOfInactivityBeforeScreenTimeout": 15,
    "passwordPreviousPasswordCountToBlock": 10,
    "passwordRequiredType": "alphanumeric",
    "passwordRequireUnlock": "daily",
    "passwordSignInFailureCountBeforeFactoryReset": 10,
    "playStoreMode": "allowList",
    "screenCaptureBlocked": false,
    "securityDeveloperSettingsEnabled": null,
    "securityRequireVerifyApps": true,
    "shortHelpText": null,
    "statusBarBlocked": null,
    "stayOnModes": [],
    "storageAllowUsb": null,
    "storageBlockExternalMedia": true,
    "storageBlockUsbFileTransfer": true,
    "systemUpdateWindowStartMinutesAfterMidnight": null,
    "systemUpdateWindowEndMinutesAfterMidnight": null,
    "systemUpdateInstallType": "deviceDefault",
    "systemWindowsBlocked": null,
    "usersBlockAdd": true,
    "usersBlockRemove": true,
    "volumeBlockAdjustment": null,
    "vpnAlwaysOnLockdownMode": false,
    "vpnAlwaysOnPackageIdentifier": "",
    "wifiBlockEditConfigurations": null,
    "wifiBlockEditPolicyDefinedConfigurations": null,
    "personalProfileAppsAllowInstallFromUnknownSources": null,
    "personalProfileCameraBlocked": null,
    "personalProfileScreenCaptureBlocked": null,
    "personalProfilePlayStoreMode": "notConfigured",
    "workProfilePasswordExpirationDays": null,
    "workProfilePasswordMinimumLength": null,
    "workProfilePasswordMinimumNumericCharacters": null,
    "workProfilePasswordMinimumNonLetterCharacters": null,
    "workProfilePasswordMinimumLetterCharacters": null,
    "workProfilePasswordMinimumLowerCaseCharacters": null,
    "workProfilePasswordMinimumUpperCaseCharacters": null,
    "workProfilePasswordMinimumSymbolCharacters": null,
    "workProfilePasswordPreviousPasswordCountToBlock": null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset": null,
    "workProfilePasswordRequiredType": "deviceDefault",
    "workProfilePasswordRequireUnlock": "deviceDefault",
    "locateDeviceUserlessDisabled": null,
    "locateDeviceLostModeEnabled": true,
    "shareDeviceLocationDisabled": null,
    "deviceLocationMode": "notConfigured",
    "azureAdSharedDeviceDataClearApps": [],
    "kioskModeApps": [],
    "kioskModeManagedFolders": [],
    "kioskModeAppPositions": [],
    "kioskModeManagedHomeScreenAppSettings": [],
    "systemUpdateFreezePeriods": [],
    "personalProfilePersonalApplications": [],
    "androidDeviceOwnerDelegatedScopeAppSettings": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('372ad8f7-5eef-4586-96ba-2f32d6211176')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
    "id": "f92d2924-9a7a-484e-859b-216c80347ce5",
    "lastModifiedDateTime": "2025-10-20T15:36:23.386055Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-10-20T15:36:23.386055Z",
    "description": null,
    "displayName": "Chromium Local Network Access Policy",
    "version": 1,
    "omaSettings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "LocalNetworkAccessAllowedForUrls",
        "description": null,
        "omaUri": "./Device/Vendor/MSFT/Policy/Config/Chrome~Policy~googlechrome/LocalNetworkAccessAllowedForUrls",
        "secretReferenceValueId": "38dc9c47-9360-407f-811d-7726b2b6e6c1_f92d2924-9a7a-484e-859b-216c80347ce5_ce8e752d-2bd2-4117-bfa3-5bea33c533d4",
        "isEncrypted": true,
        "value": "****"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('f92d2924-9a7a-484e-859b-216c80347ce5')/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windows81TrustedRootCertificate",
    "id": "72228ddb-7e6e-4b0f-9c4d-46dd8a5c4074",
    "lastModifiedDateTime": "2025-07-22T17:13:01.3197292Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-04-09T14:55:06.8095755Z",
    "description": "BYOCA CLoud PKI for Windows",
    "displayName": "Cloud PKI BYOCA Root cert",
    "version": 2,
    "trustedRootCertificate": "MIIHDjCCBfagAwIBAgITTwAAABNula7GMKIeRgAAAAAAEzANBgkqhkiG9w0BAQsFADBaMRMwEQYKCZImiZPyLGQBGRYDY29tMRcwFQYKCZImiZPyLGQBGRYHY29udG9zbzEUMBIGCgmSJomT8ixkARkWBGNvcnAxFDASBgNVBAMTC2NvcnAtREMxLUNBMB4XDTI1MDMyNjE0Mjg1MFoXDTI3MDMyNjE0Mzg1MFowEDEOMAwGA1UEAxMFQllPQ0EwggIiMA0GCSqGSIb3DQEBAQUAA4ICDwAwggIKAoICAQCg6cf4BdZMi1eKeP7mkE6hYM/oW4hAIjQwu4asxNTgbWwh7nF0iVi/nxJ1wITX2CYrfLJzlcGlIlhzKUNEx04y3RKfutiePYZKE/FxEHrIQiMxbclp6sLiMrShYc1RHrtz9xW7sAV0CFGD2ikqDwvH7nw5lEE2jld+ulsPHH67yf0cRpKWfMpRaULZX6/yvLGC/8CwJfK5A4QJljHb4MZqoDvQzDr7wVJTENBJHe4KoRtpQYYXUZOoTlG/8ZQ38anRIA9MAnirVk46ySn8To89yqqgQsMEqPGVMP/S8mT9QH79cYkDs9GV0Z815uh6dnTjmIh762gRpoMFuoXbrvNKLVA7bWxmyQEaIEXx5pJdxiU7CSX9Z3rad2rVbR2DlOrJe3Ae9+zeAKdhidqz2Py/tGmzrqlQQRfiKhM6Ww1hNMyj2w21LmygmixT2YrA2mKx7QDKx5fjCVC3QpHH7YuUu8H1nyLbrc7SyF8BpElpU9lUSNMiP8B6V8NsZhSy+cLeDSXHKUMVjs2Ri8I7LMWJIbwBBuxwXZmrVBVHYogCo0CIuBfC4XFRLH66+NE+3DAAXOdFPoD2cpoAB7VmRyOIBN2yCfRqsnAnnwklH6NOS8tagZxZwyJufZd0CvAnB1dD/Q4+xpyCl1K7zMxWMUF+ryHOsU4f70FQGXvBAAs7NQIDAQABo4IDFTCCAxEwDgYDVR0PAQH/BAQDAgGGMHgGA1UdJQRxMG8GBysGAQEBARYGCCsGAQUFBwMBBggrBgEFBQcDAgYIKwYBBQUHAwMGCCsGAQUFBwMEBggrBgEFBQcDBQYIKwYBBQUHAwYGCCsGAQUFBwMHBggrBgEFBQcDCAYIKwYBBQUHAwkGCisGAQQBgjcUAgIwDwYDVR0TAQH/BAUwAwEB/zAdBgNVHQ4EFgQUuuWppHMS0zAAH/pMYVDeOJvrlngwHwYDVR0jBBgwFoAU9TlWERPITNKSOXRSi+eqHfHpOVYwgc0GA1UdHwSBxTCBwjCBv6CBvKCBuYaBtmxkYXA6Ly8vQ049Y29ycC1EQzEtQ0EsQ049REMxLENOPUNEUCxDTj1QdWJsaWMlMjBLZXklMjBTZXJ2aWNlcyxDTj1TZXJ2aWNlcyxDTj1Db25maWd1cmF0aW9uLERDPWNvcnAsREM9Y29udG9zbyxEQz1jb20/Y2VydGlmaWNhdGVSZXZvY2F0aW9uTGlzdD9iYXNlP29iamVjdENsYXNzPWNSTERpc3RyaWJ1dGlvblBvaW50MIIBIgYIKwYBBQUHAQEEggEUMIIBEDCBsgYIKwYBBQUHMAKGgaVsZGFwOi8vL0NOPWNvcnAtREMxLUNBLENOPUFJQSxDTj1QdWJsaWMlMjBLZXklMjBTZXJ2aWNlcyxDTj1TZXJ2aWNlcyxDTj1Db25maWd1cmF0aW9uLERDPWNvcnAsREM9Y29udG9zbyxEQz1jb20/Y0FDZXJ0aWZpY2F0ZT9iYXNlP29iamVjdENsYXNzPWNlcnRpZmljYXRpb25BdXRob3JpdHkwWQYIKwYBBQUHMAKGTWZpbGU6Ly8vL0RDMS5jb3JwLmNvbnRvc28uY29tL0NlcnRFbnJvbGwvREMxLmNvcnAuY29udG9zby5jb21fY29ycC1EQzEtQ0EuY3J0MD4GCSsGAQQBgjcVBwQxMC8GJysGAQQBgjcVCIa6wGKHzJRGhd2TIYP3yX2E0t8ogWOEnOdTgo+LHgIBZAIBBDANBgkqhkiG9w0BAQsFAAOCAQEAVxLU+qLjYX//FlCNWSlLOg/GqccrYi6iKlEQFdjM4MeQrT5EhISwqQPUPhBUVMQpwTqIwiIqxWKr6URVooqNucH99JoDVZsxj3IjMsLZECr8T93EdEwa2xowrwEWX5sMx2Jt8/eThHcWnpLZfJWgT8cWESNdMCuzzkdxCmAHMLQN8tv+jhEkhF99CQptzkuEQ2MaFljDGFSSEJOpzFEkrKZjyHkxb7kWgJ6FtTTnH/JBn//RJehXHSdc+CwmIQ4MhHS2wUi6bwkiZxj/9Lc8frzWsIPhUQOqwAH5KRerY6Dj8pVISXROMxOcpOa77Iwy3ixdY2I+QT/U0UqYPvtY4g==",
    "certFileName": "BYOCA.cer",
    "destinationStore": "computerCertStoreRoot",
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('72228ddb-7e6e-4b0f-9c4d-46dd8a5c4074')/microsoft.graph.windows81TrustedRootCertificate/assignments",
    "assignments": [
      {
        "id": "72228ddb-7e6e-4b0f-9c4d-46dd8a5c4074_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "72228ddb-7e6e-4b0f-9c4d-46dd8a5c4074",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows81TrustedRootCertificate",
    "id": "25d8ae95-2bbb-4fae-a634-4573f356463c",
    "lastModifiedDateTime": "2025-07-22T17:12:43.262979Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-03-26T14:14:33.3730558Z",
    "description": "Root CA CLoud PKI for Windows",
    "displayName": "Cloud PKI Root CA cert",
    "version": 2,
    "trustedRootCertificate": "MIIDjjCCAnagAwIBAgIQYD3+8/iEt0MPkGywpTFzcjANBgkqhkiG9w0BAQsFADARMQ8wDQYDVQQDDAZSb290Q0EwHhcNMjUwMzI2MTQxMTA2WhcNMzAwMzI2MTQxMTA2WjARMQ8wDQYDVQQDDAZSb290Q0EwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCsFYmRHYMzlT3/uchohFrlB45G1xU5gMES7utvH/ItqTWRNTGy+OmZQ1KHmxTcFZbDERSX7FOcNCwvsshsfAU8Pjt2Pp0BTXnNGbx1+4HvgkPXTM9hEfkNA9Zb+8mC039EK5/SdjUjxhEHZAiDYNjcoIGtIhrZJD1jySoFa9z7i9RBGhiFySJVK6DPTV0+FI/c607e0bLeX89h6kSgHiU4yMAh6h1/SHN25se30L3ysSiiso0S5ybozd+clpao0J+GyeUe8qNp1/5UWk8DQq1SMd713SpePFWumWGlytDfoIEAqNw6eWvgHd16PIFc8PYYH4lfEULxaoVkO+NNt1oFAgMBAAGjgeEwgd4wEgYDVR0TAQH/BAgwBgEB/wIBATAOBgNVHQ8BAf8EBAMCAYYweAYDVR0lBHEwbwYHKwYBAQEBFgYKKwYBBAGCNxQCAgYIKwYBBQUHAwEGCCsGAQUFBwMCBggrBgEFBQcDAwYIKwYBBQUHAwQGCCsGAQUFBwMFBggrBgEFBQcDBgYIKwYBBQUHAwcGCCsGAQUFBwMIBggrBgEFBQcDCTAdBgNVHQ4EFgQU2p1dxRfH/jzlBMbjJXVGcwvJ+E4wHwYDVR0jBBgwFoAU2p1dxRfH/jzlBMbjJXVGcwvJ+E4wDQYJKoZIhvcNAQELBQADggEBAKIh47OnU7vx5tuVSFbWu7LlT4F6aRW+d6599cishx4of6J8scIOFPxu7ixSKBhB7JQc5ReaUxHxCVDJVcSCrQ4H66Z0wh3J0mZtSZ2K8IghTNtHjrebODq5dDoEpjsaLmK8VRYLtVYMXELQ9NWNEbR957XrDmLK85ctsrym1e+Yqv7U7S8mPqL0GhYM7dYAX4WsXwqtDa0Hf1NeniMvjSI5WdOfGn7WKtbpmeItiVWGO+63nNTIIfWXy5bMH2hgrRkgMR2a2+PirgpzREtRtDaqCN6tCXkEKoQg1utmyylRaNtoQvhMuBxB/OSOaOY0WE2qrBhgL3I/vdAruEO5Ef4=",
    "certFileName": "RootCA.cer",
    "destinationStore": "computerCertStoreRoot",
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('25d8ae95-2bbb-4fae-a634-4573f356463c')/microsoft.graph.windows81TrustedRootCertificate/assignments",
    "assignments": [
      {
        "id": "25d8ae95-2bbb-4fae-a634-4573f356463c_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "25d8ae95-2bbb-4fae-a634-4573f356463c",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows81TrustedRootCertificate",
    "id": "288df509-4e2f-45d4-938b-a58be32afd11",
    "lastModifiedDateTime": "2025-03-26T14:16:18.0286096Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-03-26T14:16:18.0286096Z",
    "description": null,
    "displayName": "Cloud PKI trusted Cert Issuing CA",
    "version": 1,
    "trustedRootCertificate": "MIIEyzCCA7OgAwIBAgIRAJS2OtgTBtynNMN/t8xDx5MwDQYJKoZIhvcNAQELBQAwETEPMA0GA1UEAwwGUm9vdENBMB4XDTI1MDMyNjE0MTMxNFoXDTI5MDMyNjE0MTMxNFowFDESMBAGA1UEAwwJSXNzdWluZ0NBMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAlwDu/qU8i/h3vwuA9f0YbYNz9kk0j56MXqpieEj/L3eB99r19uwY8mrTVswmB17+3SXpdlCkpG+tHJ2kwpaGUOsLvTkcYUWJXIFxJHuO11Y0RVyVPhoWjCzyybg88mNTH7j3mxzPIkaoIjqXBwWVfVyE0b88Znbwk3uyuZPMXVdR8pvkmlI2dDLGojrGgniIXhgrpfNMsBd5BNnK3N8wGEgulaJDVMlYAT1B7zM9Rhhsp89YMFLryqsasXR4OHV8cUbypsiqhqJfss8CGSqmm5mL1j3KxaWv/RAWZrKIyLctudiLyeYj7BWXXLiq988a88zLG0+iFzgJRLkKSoqDnQIDAQABo4ICGTCCAhUwDgYDVR0PAQH/BAQDAgGGMBIGA1UdEwEB/wQIMAYBAf8CAQAweAYDVR0lBHEwbwYHKwYBAQEBFgYIKwYBBQUHAwEGCCsGAQUFBwMCBggrBgEFBQcDAwYIKwYBBQUHAwQGCCsGAQUFBwMFBggrBgEFBQcDBgYIKwYBBQUHAwcGCCsGAQUFBwMIBggrBgEFBQcDCQYKKwYBBAGCNxQCAjAdBgNVHQ4EFgQUIAD62zboP8rF0P/9GWsO9uEus9AwHwYDVR0jBBgwFoAU2p1dxRfH/jzlBMbjJXVGcwvJ+E4wggEzBggrBgEFBQcBAQSCASUwggEhMIGRBggrBgEFBQcwAoaBhGh0dHA6Ly9wcmltYXJ5LWNkbi5wa2kuYXp1cmUubmV0L2NlbnRyYWx1cy9jYWNlcnRzL2NjMWI1OTQ5MjlmMTQ5Yzc4N2U5NmI3OTg0N2I2Yjg0L2I1ZDE5NWM0LTEwNGMtNGFlMi1hOGI0LWNlYWE4YzFiZTE2NV92MS9jZXJ0LmNlcjCBigYIKwYBBQUHMAKGfmh0dHA6Ly9jYzFiNTk0OTI5ZjE0OWM3ODdlOTZiNzk4NDdiNmI4NC5jZW50cmFsdXMucGtpLmF6dXJlLm5ldC9jZXJ0aWZpY2F0ZUF1dGhvcml0aWVzL2I1ZDE5NWM0LTEwNGMtNGFlMi1hOGI0LWNlYWE4YzFiZTE2NV92MTANBgkqhkiG9w0BAQsFAAOCAQEAh16eskysLZomtEzS07sQKUrKE4bcUcE4DyYj0ge/ogukw2oQ7K36uaJmvf0It8SPho/E4hb3JU0o5LHydS5uDK2oQuUDtawilaB1ytFlLE6QmNC1OnJKvISAbc+j/Zv9IvGnC1oTKSGS0a6Ew9lN6tPi5/+GXtiEwgHFx+S2s9yiJ0sjt5445nILoNWbFQrTuMI6vhdtfd7cExUjsELedjS1/UPBBctw/YrQ74baw0HSTepZDJteG/WDoWNB0XLIWFuo3aGINfN7Utz06GXLHqCeO/ujUkoq+lzXIMmogeOxv87TY4CfcF/Yfr8j24BNjReLHX26CZv6n7wkco1awg==",
    "certFileName": "IssuingCA.cer",
    "destinationStore": "computerCertStoreIntermediate",
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('288df509-4e2f-45d4-938b-a58be32afd11')/microsoft.graph.windows81TrustedRootCertificate/assignments",
    "assignments": [
      {
        "id": "288df509-4e2f-45d4-938b-a58be32afd11_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "288df509-4e2f-45d4-938b-a58be32afd11",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows81SCEPCertificateProfile",
    "id": "795403e5-495d-445f-a71e-99b7e2c8e95d",
    "lastModifiedDateTime": "2025-04-09T14:56:04.5571746Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-04-09T14:55:48.1787678Z",
    "description": null,
    "displayName": "CloudPKI-CertificateBYOCA-Device",
    "version": 3,
    "renewalThresholdPercentage": 20,
    "keyStorageProvider": "useTpmKspOtherwiseUseSoftwareKsp",
    "subjectNameFormat": "custom",
    "subjectAlternativeNameType": "none",
    "certificateValidityPeriodValue": 2,
    "certificateValidityPeriodScale": "years",
    "scepServerUrls": [
      "https://{{CloudPKIFQDN}}/TrafficGateway/PassThroughRoutingService/CloudPki/CloudPkiService/Scep/38dc9c47-9360-407f-811d-7726b2b6e6c1/dc185b26-426f-49b5-a18c-b9097ed25621"
    ],
    "subjectNameFormatString": "CN={{AAD_Device_ID}}",
    "keyUsage": "keyEncipherment,digitalSignature",
    "keySize": "size2048",
    "hashAlgorithm": "sha2",
    "subjectAlternativeNameFormatString": null,
    "certificateStore": "machine",
    "extendedKeyUsages": [
      {
        "name": "Client Authentication",
        "objectIdentifier": "1.3.6.1.5.5.7.3.2"
      }
    ],
    "customSubjectAlternativeNames": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('795403e5-495d-445f-a71e-99b7e2c8e95d')/microsoft.graph.windows81SCEPCertificateProfile/assignments",
    "assignments": [
      {
        "id": "795403e5-495d-445f-a71e-99b7e2c8e95d_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "795403e5-495d-445f-a71e-99b7e2c8e95d",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows81SCEPCertificateProfile",
    "id": "60c83ddc-4b03-44da-9aa7-3aa50c5ea714",
    "lastModifiedDateTime": "2025-04-09T17:00:45.9762336Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-04-09T17:00:45.9762336Z",
    "description": null,
    "displayName": "CloudPKI-CertificateBYOCA-User",
    "version": 1,
    "renewalThresholdPercentage": 20,
    "keyStorageProvider": "useTpmKspOtherwiseUseSoftwareKsp",
    "subjectNameFormat": "custom",
    "subjectAlternativeNameType": "none",
    "certificateValidityPeriodValue": 2,
    "certificateValidityPeriodScale": "years",
    "scepServerUrls": [
      "https://{{CloudPKIFQDN}}/TrafficGateway/PassThroughRoutingService/CloudPki/CloudPkiService/Scep/38dc9c47-9360-407f-811d-7726b2b6e6c1/dc185b26-426f-49b5-a18c-b9097ed25621"
    ],
    "subjectNameFormatString": "CN={{UserName}},E={{EmailAddress}}",
    "keyUsage": "keyEncipherment,digitalSignature",
    "keySize": "size2048",
    "hashAlgorithm": "sha2",
    "subjectAlternativeNameFormatString": null,
    "certificateStore": "user",
    "extendedKeyUsages": [
      {
        "name": "Client Authentication",
        "objectIdentifier": "1.3.6.1.5.5.7.3.2"
      }
    ],
    "customSubjectAlternativeNames": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('60c83ddc-4b03-44da-9aa7-3aa50c5ea714')/microsoft.graph.windows81SCEPCertificateProfile/assignments",
    "assignments": [
      {
        "id": "60c83ddc-4b03-44da-9aa7-3aa50c5ea714_acacacac-9df4-4c7d-9d50-4ef0226f57a9",
        "source": "direct",
        "sourceId": "60c83ddc-4b03-44da-9aa7-3aa50c5ea714",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      },
      {
        "id": "60c83ddc-4b03-44da-9aa7-3aa50c5ea714_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "60c83ddc-4b03-44da-9aa7-3aa50c5ea714",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows81SCEPCertificateProfile",
    "id": "cbb3f86d-d671-42d3-a8e3-3d02f02b240f",
    "lastModifiedDateTime": "2025-04-09T13:44:08.256729Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-04-09T13:44:08.256729Z",
    "description": "Cloud PKI",
    "displayName": "CloudPKI-Certificate-Device",
    "version": 1,
    "renewalThresholdPercentage": 20,
    "keyStorageProvider": "useTpmKspOtherwiseUseSoftwareKsp",
    "subjectNameFormat": "custom",
    "subjectAlternativeNameType": "none",
    "certificateValidityPeriodValue": 2,
    "certificateValidityPeriodScale": "years",
    "scepServerUrls": [
      "https://{{CloudPKIFQDN}}/TrafficGateway/PassThroughRoutingService/CloudPki/CloudPkiService/Scep/38dc9c47-9360-407f-811d-7726b2b6e6c1/da072a11-8444-4e9e-b1a1-fc11eb2363e0"
    ],
    "subjectNameFormatString": "CN={{AAD_Device_ID}}",
    "keyUsage": "keyEncipherment,digitalSignature",
    "keySize": "size2048",
    "hashAlgorithm": "sha2",
    "subjectAlternativeNameFormatString": null,
    "certificateStore": "machine",
    "extendedKeyUsages": [
      {
        "name": "Client Authentication",
        "objectIdentifier": "1.3.6.1.5.5.7.3.2"
      }
    ],
    "customSubjectAlternativeNames": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('cbb3f86d-d671-42d3-a8e3-3d02f02b240f')/microsoft.graph.windows81SCEPCertificateProfile/assignments",
    "assignments": [
      {
        "id": "cbb3f86d-d671-42d3-a8e3-3d02f02b240f_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "cbb3f86d-d671-42d3-a8e3-3d02f02b240f",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows81SCEPCertificateProfile",
    "id": "12f2d9ef-a876-4e5b-9063-30c95ec53448",
    "lastModifiedDateTime": "2025-04-09T13:45:28.7414044Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-04-09T13:45:28.7414044Z",
    "description": "Cloud PKI",
    "displayName": "CloudPKI-Certificate-User",
    "version": 1,
    "renewalThresholdPercentage": 20,
    "keyStorageProvider": "useTpmKspOtherwiseUseSoftwareKsp",
    "subjectNameFormat": "custom",
    "subjectAlternativeNameType": "none",
    "certificateValidityPeriodValue": 2,
    "certificateValidityPeriodScale": "years",
    "scepServerUrls": [
      "https://{{CloudPKIFQDN}}/TrafficGateway/PassThroughRoutingService/CloudPki/CloudPkiService/Scep/38dc9c47-9360-407f-811d-7726b2b6e6c1/da072a11-8444-4e9e-b1a1-fc11eb2363e0"
    ],
    "subjectNameFormatString": "CN={{UserName}},E={{EmailAddress}}",
    "keyUsage": "keyEncipherment,digitalSignature",
    "keySize": "size2048",
    "hashAlgorithm": "sha2",
    "subjectAlternativeNameFormatString": null,
    "certificateStore": "user",
    "extendedKeyUsages": [
      {
        "name": "Client Authentication",
        "objectIdentifier": "1.3.6.1.5.5.7.3.2"
      }
    ],
    "customSubjectAlternativeNames": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('12f2d9ef-a876-4e5b-9063-30c95ec53448')/microsoft.graph.windows81SCEPCertificateProfile/assignments",
    "assignments": [
      {
        "id": "12f2d9ef-a876-4e5b-9063-30c95ec53448_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "12f2d9ef-a876-4e5b-9063-30c95ec53448",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      },
      {
        "id": "12f2d9ef-a876-4e5b-9063-30c95ec53448_acacacac-9df4-4c7d-9d50-4ef0226f57a9",
        "source": "direct",
        "sourceId": "12f2d9ef-a876-4e5b-9063-30c95ec53448",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
    "id": "10b9292d-8a87-46fe-b6b4-bb5b1b8d7638",
    "lastModifiedDateTime": "2026-01-13T14:51:46.3884527Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2026-01-13T14:51:46.3884527Z",
    "description": "CUSTOM WINDOWS",
    "displayName": "CUSTOM POLICY",
    "version": 1,
    "omaSettings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "LockScreenImageUrl",
        "description": "LockScreenImageUrl",
        "omaUri": "./Vendor/MSFT/Policy/Config/DeviceLock/EnforceLockScreenAndLogonImage",
        "secretReferenceValueId": "38dc9c47-9360-407f-811d-7726b2b6e6c1_10b9292d-8a87-46fe-b6b4-bb5b1b8d7638_f48f8ee2-6342-4116-980a-cb4ef59ff5b7",
        "isEncrypted": true,
        "value": "****"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('10b9292d-8a87-46fe-b6b4-bb5b1b8d7638')/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments": [
      {
        "id": "10b9292d-8a87-46fe-b6b4-bb5b1b8d7638_acacacac-9df4-4c7d-9d50-4ef0226f57a9",
        "source": "direct",
        "sourceId": "10b9292d-8a87-46fe-b6b4-bb5b1b8d7638",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": "07032dfa-7ff1-4e44-beb6-cf13683b7105",
          "deviceAndAppManagementAssignmentFilterType": "exclude"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "id": "2f9f4004-3cdd-49f8-8dce-2ec2fcd3493a",
    "lastModifiedDateTime": "2025-07-24T21:11:04.0320907Z",
    "roleScopeTagIds": [
      "0",
      "3"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-05-23T02:46:09.6613595Z",
    "description": null,
    "displayName": "Default Restriction Policy",
    "version": 2,
    "accountsBlockModification": null,
    "appsAllowInstallFromUnknownSources": null,
    "appsAutoUpdatePolicy": null,
    "appsDefaultPermissionPolicy": null,
    "appsRecommendSkippingFirstUseHints": null,
    "bluetoothBlockConfiguration": null,
    "bluetoothBlockContactSharing": null,
    "cameraBlocked": null,
    "cellularBlockWiFiTethering": null,
    "certificateCredentialConfigurationDisabled": null,
    "crossProfilePoliciesAllowCopyPaste": null,
    "crossProfilePoliciesAllowDataSharing": "notConfigured",
    "crossProfilePoliciesShowWorkContactsInPersonalProfile": null,
    "microsoftLauncherConfigurationEnabled": null,
    "microsoftLauncherCustomWallpaperEnabled": null,
    "microsoftLauncherCustomWallpaperImageUrl": null,
    "microsoftLauncherCustomWallpaperAllowUserModification": null,
    "microsoftLauncherFeedEnabled": null,
    "microsoftLauncherFeedAllowUserModification": null,
    "microsoftLauncherDockPresenceConfiguration": null,
    "microsoftLauncherDockPresenceAllowUserModification": null,
    "microsoftLauncherSearchBarPlacementConfiguration": null,
    "enrollmentProfile": "notConfigured",
    "dataRoamingBlocked": null,
    "dateTimeConfigurationBlocked": null,
    "detailedHelpText": null,
    "deviceOwnerLockScreenMessage": null,
    "securityCommonCriteriaModeEnabled": null,
    "factoryResetDeviceAdministratorEmails": [],
    "factoryResetBlocked": null,
    "globalProxy": null,
    "googleAccountsBlocked": null,
    "kioskCustomizationDeviceSettingsBlocked": null,
    "kioskCustomizationPowerButtonActionsBlocked": null,
    "kioskCustomizationStatusBar": "notConfigured",
    "kioskCustomizationSystemErrorWarnings": null,
    "kioskCustomizationSystemNavigation": "notConfigured",
    "kioskModeScreenSaverConfigurationEnabled": null,
    "kioskModeScreenSaverImageUrl": null,
    "kioskModeScreenSaverDisplayTimeInSeconds": null,
    "kioskModeScreenSaverStartDelayInSeconds": null,
    "kioskModeScreenSaverDetectMediaDisabled": null,
    "kioskModeWallpaperUrl": null,
    "kioskModeExitCode": null,
    "kioskModeVirtualHomeButtonEnabled": null,
    "kioskModeVirtualHomeButtonType": null,
    "kioskModeBluetoothConfigurationEnabled": null,
    "kioskModeWiFiConfigurationEnabled": null,
    "kioskModeFlashlightConfigurationEnabled": null,
    "kioskModeMediaVolumeConfigurationEnabled": null,
    "kioskModeShowDeviceInfo": null,
    "kioskModeManagedSettingsEntryDisabled": null,
    "kioskModeDebugMenuEasyAccessEnabled": null,
    "kioskModeShowAppNotificationBadge": null,
    "kioskModeScreenOrientation": null,
    "kioskModeIconSize": null,
    "kioskModeFolderIcon": null,
    "kioskModeWifiAllowedSsids": [],
    "kioskModeAppOrderEnabled": null,
    "kioskModeAppsInFolderOrderedByName": null,
    "kioskModeGridHeight": null,
    "kioskModeGridWidth": null,
    "kioskModeLockHomeScreen": null,
    "kioskModeManagedHomeScreenAutoSignout": null,
    "kioskModeManagedHomeScreenInactiveSignOutDelayInSeconds": null,
    "kioskModeManagedHomeScreenInactiveSignOutNoticeInSeconds": null,
    "kioskModeManagedHomeScreenPinComplexity": null,
    "kioskModeManagedHomeScreenPinRequired": null,
    "kioskModeManagedHomeScreenPinRequiredToResume": null,
    "kioskModeManagedHomeScreenSignInBackground": null,
    "kioskModeManagedHomeScreenSignInBrandingLogo": null,
    "kioskModeManagedHomeScreenSignInEnabled": null,
    "kioskModeUseManagedHomeScreenApp": "notConfigured",
    "microphoneForceMute": null,
    "networkEscapeHatchAllowed": null,
    "nfcBlockOutgoingBeam": null,
    "passwordBlockKeyguard": null,
    "passwordBlockKeyguardFeatures": [],
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinimumLetterCharacters": null,
    "passwordMinimumLowerCaseCharacters": null,
    "passwordMinimumNonLetterCharacters": null,
    "passwordMinimumNumericCharacters": null,
    "passwordMinimumSymbolCharacters": null,
    "passwordMinimumUpperCaseCharacters": null,
    "passwordMinutesOfInactivityBeforeScreenTimeout": null,
    "passwordPreviousPasswordCountToBlock": null,
    "passwordRequiredType": "deviceDefault",
    "passwordRequireUnlock": "deviceDefault",
    "passwordSignInFailureCountBeforeFactoryReset": null,
    "playStoreMode": null,
    "screenCaptureBlocked": null,
    "securityDeveloperSettingsEnabled": null,
    "securityRequireVerifyApps": true,
    "shortHelpText": null,
    "statusBarBlocked": null,
    "stayOnModes": [],
    "storageAllowUsb": null,
    "storageBlockExternalMedia": null,
    "storageBlockUsbFileTransfer": null,
    "systemUpdateWindowStartMinutesAfterMidnight": null,
    "systemUpdateWindowEndMinutesAfterMidnight": null,
    "systemUpdateInstallType": null,
    "systemWindowsBlocked": null,
    "usersBlockAdd": null,
    "usersBlockRemove": null,
    "volumeBlockAdjustment": null,
    "vpnAlwaysOnLockdownMode": false,
    "vpnAlwaysOnPackageIdentifier": "",
    "wifiBlockEditConfigurations": null,
    "wifiBlockEditPolicyDefinedConfigurations": null,
    "personalProfileAppsAllowInstallFromUnknownSources": null,
    "personalProfileCameraBlocked": null,
    "personalProfileScreenCaptureBlocked": null,
    "personalProfilePlayStoreMode": "notConfigured",
    "workProfilePasswordExpirationDays": null,
    "workProfilePasswordMinimumLength": null,
    "workProfilePasswordMinimumNumericCharacters": null,
    "workProfilePasswordMinimumNonLetterCharacters": null,
    "workProfilePasswordMinimumLetterCharacters": null,
    "workProfilePasswordMinimumLowerCaseCharacters": null,
    "workProfilePasswordMinimumUpperCaseCharacters": null,
    "workProfilePasswordMinimumSymbolCharacters": null,
    "workProfilePasswordPreviousPasswordCountToBlock": null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset": null,
    "workProfilePasswordRequiredType": "deviceDefault",
    "workProfilePasswordRequireUnlock": "deviceDefault",
    "locateDeviceUserlessDisabled": null,
    "locateDeviceLostModeEnabled": null,
    "shareDeviceLocationDisabled": null,
    "deviceLocationMode": "notConfigured",
    "azureAdSharedDeviceDataClearApps": [],
    "kioskModeApps": [],
    "kioskModeManagedFolders": [],
    "kioskModeAppPositions": [],
    "kioskModeManagedHomeScreenAppSettings": [],
    "systemUpdateFreezePeriods": [],
    "personalProfilePersonalApplications": [],
    "androidDeviceOwnerDelegatedScopeAppSettings": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('2f9f4004-3cdd-49f8-8dce-2ec2fcd3493a')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments",
    "assignments": [
      {
        "id": "2f9f4004-3cdd-49f8-8dce-2ec2fcd3493a_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "2f9f4004-3cdd-49f8-8dce-2ec2fcd3493a",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration",
    "id": "abafb7d7-f37f-4261-a22e-80f6317c5def",
    "lastModifiedDateTime": "2025-03-27T02:40:54.9974001Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-03-27T02:40:54.9974001Z",
    "description": null,
    "displayName": "Enable Locate Device",
    "version": 1,
    "accountsBlockModification": null,
    "appsAllowInstallFromUnknownSources": null,
    "appsAutoUpdatePolicy": null,
    "appsDefaultPermissionPolicy": null,
    "appsRecommendSkippingFirstUseHints": null,
    "bluetoothBlockConfiguration": null,
    "bluetoothBlockContactSharing": null,
    "cameraBlocked": null,
    "cellularBlockWiFiTethering": null,
    "certificateCredentialConfigurationDisabled": null,
    "crossProfilePoliciesAllowCopyPaste": null,
    "crossProfilePoliciesAllowDataSharing": "notConfigured",
    "crossProfilePoliciesShowWorkContactsInPersonalProfile": null,
    "microsoftLauncherConfigurationEnabled": null,
    "microsoftLauncherCustomWallpaperEnabled": null,
    "microsoftLauncherCustomWallpaperImageUrl": null,
    "microsoftLauncherCustomWallpaperAllowUserModification": null,
    "microsoftLauncherFeedEnabled": null,
    "microsoftLauncherFeedAllowUserModification": null,
    "microsoftLauncherDockPresenceConfiguration": null,
    "microsoftLauncherDockPresenceAllowUserModification": null,
    "microsoftLauncherSearchBarPlacementConfiguration": null,
    "enrollmentProfile": "notConfigured",
    "dataRoamingBlocked": null,
    "dateTimeConfigurationBlocked": null,
    "detailedHelpText": null,
    "deviceOwnerLockScreenMessage": null,
    "securityCommonCriteriaModeEnabled": null,
    "factoryResetDeviceAdministratorEmails": [],
    "factoryResetBlocked": null,
    "globalProxy": null,
    "googleAccountsBlocked": null,
    "kioskCustomizationDeviceSettingsBlocked": null,
    "kioskCustomizationPowerButtonActionsBlocked": null,
    "kioskCustomizationStatusBar": "notConfigured",
    "kioskCustomizationSystemErrorWarnings": null,
    "kioskCustomizationSystemNavigation": "notConfigured",
    "kioskModeScreenSaverConfigurationEnabled": null,
    "kioskModeScreenSaverImageUrl": null,
    "kioskModeScreenSaverDisplayTimeInSeconds": null,
    "kioskModeScreenSaverStartDelayInSeconds": null,
    "kioskModeScreenSaverDetectMediaDisabled": null,
    "kioskModeWallpaperUrl": null,
    "kioskModeExitCode": null,
    "kioskModeVirtualHomeButtonEnabled": null,
    "kioskModeVirtualHomeButtonType": null,
    "kioskModeBluetoothConfigurationEnabled": null,
    "kioskModeWiFiConfigurationEnabled": null,
    "kioskModeFlashlightConfigurationEnabled": null,
    "kioskModeMediaVolumeConfigurationEnabled": null,
    "kioskModeShowDeviceInfo": null,
    "kioskModeManagedSettingsEntryDisabled": null,
    "kioskModeDebugMenuEasyAccessEnabled": null,
    "kioskModeShowAppNotificationBadge": null,
    "kioskModeScreenOrientation": null,
    "kioskModeIconSize": null,
    "kioskModeFolderIcon": null,
    "kioskModeWifiAllowedSsids": [],
    "kioskModeAppOrderEnabled": null,
    "kioskModeAppsInFolderOrderedByName": null,
    "kioskModeGridHeight": null,
    "kioskModeGridWidth": null,
    "kioskModeLockHomeScreen": null,
    "kioskModeManagedHomeScreenAutoSignout": null,
    "kioskModeManagedHomeScreenInactiveSignOutDelayInSeconds": null,
    "kioskModeManagedHomeScreenInactiveSignOutNoticeInSeconds": null,
    "kioskModeManagedHomeScreenPinComplexity": null,
    "kioskModeManagedHomeScreenPinRequired": null,
    "kioskModeManagedHomeScreenPinRequiredToResume": null,
    "kioskModeManagedHomeScreenSignInBackground": null,
    "kioskModeManagedHomeScreenSignInBrandingLogo": null,
    "kioskModeManagedHomeScreenSignInEnabled": null,
    "kioskModeUseManagedHomeScreenApp": "notConfigured",
    "microphoneForceMute": null,
    "networkEscapeHatchAllowed": null,
    "nfcBlockOutgoingBeam": null,
    "passwordBlockKeyguard": null,
    "passwordBlockKeyguardFeatures": [],
    "passwordExpirationDays": null,
    "passwordMinimumLength": null,
    "passwordMinimumLetterCharacters": null,
    "passwordMinimumLowerCaseCharacters": null,
    "passwordMinimumNonLetterCharacters": null,
    "passwordMinimumNumericCharacters": null,
    "passwordMinimumSymbolCharacters": null,
    "passwordMinimumUpperCaseCharacters": null,
    "passwordMinutesOfInactivityBeforeScreenTimeout": null,
    "passwordPreviousPasswordCountToBlock": null,
    "passwordRequiredType": "deviceDefault",
    "passwordRequireUnlock": "deviceDefault",
    "passwordSignInFailureCountBeforeFactoryReset": null,
    "playStoreMode": null,
    "screenCaptureBlocked": null,
    "securityDeveloperSettingsEnabled": null,
    "securityRequireVerifyApps": true,
    "shortHelpText": null,
    "statusBarBlocked": null,
    "stayOnModes": [],
    "storageAllowUsb": null,
    "storageBlockExternalMedia": null,
    "storageBlockUsbFileTransfer": null,
    "systemUpdateWindowStartMinutesAfterMidnight": null,
    "systemUpdateWindowEndMinutesAfterMidnight": null,
    "systemUpdateInstallType": null,
    "systemWindowsBlocked": null,
    "usersBlockAdd": null,
    "usersBlockRemove": null,
    "volumeBlockAdjustment": null,
    "vpnAlwaysOnLockdownMode": false,
    "vpnAlwaysOnPackageIdentifier": "",
    "wifiBlockEditConfigurations": null,
    "wifiBlockEditPolicyDefinedConfigurations": null,
    "personalProfileAppsAllowInstallFromUnknownSources": null,
    "personalProfileCameraBlocked": null,
    "personalProfileScreenCaptureBlocked": null,
    "personalProfilePlayStoreMode": "notConfigured",
    "workProfilePasswordExpirationDays": null,
    "workProfilePasswordMinimumLength": null,
    "workProfilePasswordMinimumNumericCharacters": null,
    "workProfilePasswordMinimumNonLetterCharacters": null,
    "workProfilePasswordMinimumLetterCharacters": null,
    "workProfilePasswordMinimumLowerCaseCharacters": null,
    "workProfilePasswordMinimumUpperCaseCharacters": null,
    "workProfilePasswordMinimumSymbolCharacters": null,
    "workProfilePasswordPreviousPasswordCountToBlock": null,
    "workProfilePasswordSignInFailureCountBeforeFactoryReset": null,
    "workProfilePasswordRequiredType": "deviceDefault",
    "workProfilePasswordRequireUnlock": "deviceDefault",
    "locateDeviceUserlessDisabled": null,
    "locateDeviceLostModeEnabled": true,
    "shareDeviceLocationDisabled": null,
    "deviceLocationMode": null,
    "azureAdSharedDeviceDataClearApps": [],
    "kioskModeApps": [],
    "kioskModeManagedFolders": [],
    "kioskModeAppPositions": [],
    "kioskModeManagedHomeScreenAppSettings": [],
    "systemUpdateFreezePeriods": [],
    "personalProfilePersonalApplications": [],
    "androidDeviceOwnerDelegatedScopeAppSettings": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('abafb7d7-f37f-4261-a22e-80f6317c5def')/microsoft.graph.androidDeviceOwnerGeneralDeviceConfiguration/assignments",
    "assignments": [
      {
        "id": "abafb7d7-f37f-4261-a22e-80f6317c5def_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "abafb7d7-f37f-4261-a22e-80f6317c5def",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows10EndpointProtectionConfiguration",
    "id": "4a6c880c-7457-4e98-9e22-a217ad8bdcc8",
    "lastModifiedDateTime": "2025-05-22T03:27:43.1556296Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-05-22T03:23:50.870613Z",
    "description": null,
    "displayName": "Endpoint protection - Windows Encryption",
    "version": 2,
    "applicationGuardEnabled": false,
    "applicationGuardEnabledOptions": "notConfigured",
    "applicationGuardBlockFileTransfer": "notConfigured",
    "applicationGuardBlockNonEnterpriseContent": false,
    "applicationGuardAllowPersistence": false,
    "applicationGuardForceAuditing": false,
    "applicationGuardBlockClipboardSharing": "notConfigured",
    "applicationGuardAllowPrintToPDF": false,
    "applicationGuardAllowPrintToXPS": false,
    "applicationGuardAllowPrintToLocalPrinters": false,
    "applicationGuardAllowPrintToNetworkPrinters": false,
    "applicationGuardAllowVirtualGPU": false,
    "applicationGuardAllowFileSaveOnHost": false,
    "applicationGuardAllowCameraMicrophoneRedirection": null,
    "applicationGuardCertificateThumbprints": [],
    "appLockerApplicationControl": "notConfigured",
    "bitLockerAllowStandardUserEncryption": false,
    "bitLockerDisableWarningForOtherDiskEncryption": false,
    "bitLockerEnableStorageCardEncryptionOnMobile": false,
    "bitLockerEncryptDevice": true,
    "bitLockerRecoveryPasswordRotation": "notConfigured",
    "defenderSecurityCenterDisableAppBrowserUI": null,
    "defenderSecurityCenterDisableFamilyUI": null,
    "defenderSecurityCenterDisableHealthUI": null,
    "defenderSecurityCenterDisableNetworkUI": null,
    "defenderSecurityCenterDisableVirusUI": null,
    "defenderSecurityCenterDisableAccountUI": null,
    "defenderSecurityCenterDisableClearTpmUI": null,
    "defenderSecurityCenterDisableHardwareUI": null,
    "defenderSecurityCenterDisableNotificationAreaUI": null,
    "defenderSecurityCenterDisableRansomwareUI": null,
    "defenderSecurityCenterDisableSecureBootUI": null,
    "defenderSecurityCenterDisableTroubleshootingUI": null,
    "defenderSecurityCenterDisableVulnerableTpmFirmwareUpdateUI": null,
    "defenderSecurityCenterOrganizationDisplayName": null,
    "defenderSecurityCenterHelpEmail": null,
    "defenderSecurityCenterHelpPhone": null,
    "defenderSecurityCenterHelpURL": null,
    "defenderSecurityCenterNotificationsFromApp": "notConfigured",
    "defenderSecurityCenterITContactDisplay": "notConfigured",
    "windowsDefenderTamperProtection": "notConfigured",
    "defenderAdobeReaderLaunchChildProcess": "notConfigured",
    "defenderAttackSurfaceReductionExcludedPaths": [],
    "defenderOfficeAppsOtherProcessInjectionType": "userDefined",
    "defenderOfficeAppsOtherProcessInjection": "userDefined",
    "defenderOfficeCommunicationAppsLaunchChildProcess": "notConfigured",
    "defenderOfficeAppsExecutableContentCreationOrLaunchType": "userDefined",
    "defenderOfficeAppsExecutableContentCreationOrLaunch": "userDefined",
    "defenderOfficeAppsLaunchChildProcessType": "userDefined",
    "defenderOfficeAppsLaunchChildProcess": "userDefined",
    "defenderOfficeMacroCodeAllowWin32ImportsType": "userDefined",
    "defenderOfficeMacroCodeAllowWin32Imports": "userDefined",
    "defenderScriptObfuscatedMacroCodeType": "userDefined",
    "defenderScriptObfuscatedMacroCode": "userDefined",
    "defenderScriptDownloadedPayloadExecutionType": "userDefined",
    "defenderScriptDownloadedPayloadExecution": "userDefined",
    "defenderPreventCredentialStealingType": "notConfigured",
    "defenderProcessCreationType": "userDefined",
    "defenderProcessCreation": "userDefined",
    "defenderUntrustedUSBProcessType": "userDefined",
    "defenderUntrustedUSBProcess": "userDefined",
    "defenderUntrustedExecutableType": "userDefined",
    "defenderUntrustedExecutable": "userDefined",
    "defenderEmailContentExecutionType": "userDefined",
    "defenderEmailContentExecution": "userDefined",
    "defenderAdvancedRansomewareProtectionType": "notConfigured",
    "defenderGuardMyFoldersType": "userDefined",
    "defenderGuardedFoldersAllowedAppPaths": [],
    "defenderAdditionalGuardedFolders": [],
    "defenderNetworkProtectionType": "notConfigured",
    "defenderExploitProtectionXml": null,
    "defenderExploitProtectionXmlFileName": null,
    "defenderSecurityCenterBlockExploitProtectionOverride": false,
    "defenderBlockPersistenceThroughWmiType": "userDefined",
    "firewallBlockStatefulFTP": null,
    "firewallIdleTimeoutForSecurityAssociationInSeconds": null,
    "firewallPreSharedKeyEncodingMethod": "deviceDefault",
    "firewallIPSecExemptionsNone": false,
    "firewallIPSecExemptionsAllowNeighborDiscovery": false,
    "firewallIPSecExemptionsAllowICMP": false,
    "firewallIPSecExemptionsAllowRouterDiscovery": false,
    "firewallIPSecExemptionsAllowDHCP": false,
    "firewallCertificateRevocationListCheckMethod": "deviceDefault",
    "firewallMergeKeyingModuleSettings": null,
    "firewallPacketQueueingMethod": "deviceDefault",
    "firewallProfileDomain": null,
    "firewallProfilePublic": null,
    "firewallProfilePrivate": null,
    "localSecurityOptionsBlockMicrosoftAccounts": false,
    "localSecurityOptionsBlockRemoteLogonWithBlankPassword": false,
    "localSecurityOptionsDisableAdministratorAccount": false,
    "localSecurityOptionsAdministratorAccountName": null,
    "localSecurityOptionsDisableGuestAccount": false,
    "localSecurityOptionsGuestAccountName": null,
    "localSecurityOptionsAllowUndockWithoutHavingToLogon": false,
    "localSecurityOptionsBlockUsersInstallingPrinterDrivers": false,
    "localSecurityOptionsBlockRemoteOpticalDriveAccess": false,
    "localSecurityOptionsFormatAndEjectOfRemovableMediaAllowedUser": "notConfigured",
    "localSecurityOptionsMachineInactivityLimit": null,
    "localSecurityOptionsMachineInactivityLimitInMinutes": null,
    "localSecurityOptionsDoNotRequireCtrlAltDel": false,
    "localSecurityOptionsHideLastSignedInUser": false,
    "localSecurityOptionsHideUsernameAtSignIn": false,
    "localSecurityOptionsLogOnMessageTitle": null,
    "localSecurityOptionsLogOnMessageText": null,
    "localSecurityOptionsAllowPKU2UAuthenticationRequests": false,
    "localSecurityOptionsAllowRemoteCallsToSecurityAccountsManagerHelperBool": false,
    "localSecurityOptionsAllowRemoteCallsToSecurityAccountsManager": null,
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedClients": "none",
    "localSecurityOptionsMinimumSessionSecurityForNtlmSspBasedServers": "none",
    "lanManagerAuthenticationLevel": "lmAndNltm",
    "lanManagerWorkstationDisableInsecureGuestLogons": false,
    "localSecurityOptionsClearVirtualMemoryPageFile": false,
    "localSecurityOptionsAllowSystemToBeShutDownWithoutHavingToLogOn": false,
    "localSecurityOptionsAllowUIAccessApplicationElevation": false,
    "localSecurityOptionsVirtualizeFileAndRegistryWriteFailuresToPerUserLocations": false,
    "localSecurityOptionsOnlyElevateSignedExecutables": false,
    "localSecurityOptionsAdministratorElevationPromptBehavior": "notConfigured",
    "localSecurityOptionsStandardUserElevationPromptBehavior": "notConfigured",
    "localSecurityOptionsSwitchToSecureDesktopWhenPromptingForElevation": false,
    "localSecurityOptionsDetectApplicationInstallationsAndPromptForElevation": false,
    "localSecurityOptionsAllowUIAccessApplicationsForSecureLocations": false,
    "localSecurityOptionsUseAdminApprovalMode": false,
    "localSecurityOptionsUseAdminApprovalModeForAdministrators": false,
    "localSecurityOptionsInformationShownOnLockScreen": "notConfigured",
    "localSecurityOptionsInformationDisplayedOnLockScreen": "notConfigured",
    "localSecurityOptionsDisableClientDigitallySignCommunicationsIfServerAgrees": false,
    "localSecurityOptionsClientDigitallySignCommunicationsAlways": false,
    "localSecurityOptionsClientSendUnencryptedPasswordToThirdPartySMBServers": false,
    "localSecurityOptionsDisableServerDigitallySignCommunicationsAlways": false,
    "localSecurityOptionsDisableServerDigitallySignCommunicationsIfClientAgrees": false,
    "localSecurityOptionsRestrictAnonymousAccessToNamedPipesAndShares": false,
    "localSecurityOptionsDoNotAllowAnonymousEnumerationOfSAMAccounts": false,
    "localSecurityOptionsAllowAnonymousEnumerationOfSAMAccountsAndShares": false,
    "localSecurityOptionsDoNotStoreLANManagerHashValueOnNextPasswordChange": false,
    "localSecurityOptionsSmartCardRemovalBehavior": "noAction",
    "deviceGuardLocalSystemAuthorityCredentialGuardSettings": "notConfigured",
    "deviceGuardEnableVirtualizationBasedSecurity": false,
    "deviceGuardEnableSecureBootWithDMA": false,
    "deviceGuardSecureBootWithDMA": "notConfigured",
    "deviceGuardLaunchSystemGuard": "notConfigured",
    "defenderDisableScanArchiveFiles": null,
    "defenderAllowScanArchiveFiles": null,
    "defenderDisableBehaviorMonitoring": null,
    "defenderAllowBehaviorMonitoring": null,
    "defenderDisableCloudProtection": null,
    "defenderAllowCloudProtection": null,
    "defenderEnableScanIncomingMail": null,
    "defenderEnableScanMappedNetworkDrivesDuringFullScan": null,
    "defenderDisableScanRemovableDrivesDuringFullScan": null,
    "defenderAllowScanRemovableDrivesDuringFullScan": null,
    "defenderDisableScanDownloads": null,
    "defenderAllowScanDownloads": null,
    "defenderDisableIntrusionPreventionSystem": null,
    "defenderAllowIntrusionPreventionSystem": null,
    "defenderDisableOnAccessProtection": null,
    "defenderAllowOnAccessProtection": null,
    "defenderDisableRealTimeMonitoring": null,
    "defenderAllowRealTimeMonitoring": null,
    "defenderDisableScanNetworkFiles": null,
    "defenderAllowScanNetworkFiles": null,
    "defenderDisableScanScriptsLoadedInInternetExplorer": null,
    "defenderAllowScanScriptsLoadedInInternetExplorer": null,
    "defenderBlockEndUserAccess": null,
    "defenderAllowEndUserAccess": null,
    "defenderScanMaxCpuPercentage": null,
    "defenderCheckForSignaturesBeforeRunningScan": null,
    "defenderCloudBlockLevel": null,
    "defenderCloudExtendedTimeoutInSeconds": null,
    "defenderDaysBeforeDeletingQuarantinedMalware": null,
    "defenderDisableCatchupFullScan": null,
    "defenderDisableCatchupQuickScan": null,
    "defenderEnableLowCpuPriority": null,
    "defenderFileExtensionsToExclude": [],
    "defenderFilesAndFoldersToExclude": [],
    "defenderProcessesToExclude": [],
    "defenderPotentiallyUnwantedAppAction": null,
    "defenderScanDirection": null,
    "defenderScanType": null,
    "defenderScheduledQuickScanTime": null,
    "defenderScheduledScanDay": null,
    "defenderScheduledScanTime": null,
    "defenderSignatureUpdateIntervalInHours": null,
    "defenderSubmitSamplesConsentType": null,
    "defenderDetectedMalwareActions": null,
    "dmaGuardDeviceEnumerationPolicy": "deviceDefault",
    "smartScreenEnableInShell": false,
    "smartScreenBlockOverrideForFiles": false,
    "userRightsAccessCredentialManagerAsTrustedCaller": null,
    "userRightsAllowAccessFromNetwork": null,
    "userRightsBlockAccessFromNetwork": null,
    "userRightsActAsPartOfTheOperatingSystem": null,
    "userRightsLocalLogOn": null,
    "userRightsDenyLocalLogOn": null,
    "userRightsBackupData": null,
    "userRightsChangeSystemTime": null,
    "userRightsCreateGlobalObjects": null,
    "userRightsCreatePageFile": null,
    "userRightsCreatePermanentSharedObjects": null,
    "userRightsCreateSymbolicLinks": null,
    "userRightsCreateToken": null,
    "userRightsDebugPrograms": null,
    "userRightsRemoteDesktopServicesLogOn": null,
    "userRightsDelegation": null,
    "userRightsGenerateSecurityAudits": null,
    "userRightsImpersonateClient": null,
    "userRightsIncreaseSchedulingPriority": null,
    "userRightsLoadUnloadDrivers": null,
    "userRightsLockMemory": null,
    "userRightsManageAuditingAndSecurityLogs": null,
    "userRightsManageVolumes": null,
    "userRightsModifyFirmwareEnvironment": null,
    "userRightsModifyObjectLabels": null,
    "userRightsProfileSingleProcess": null,
    "userRightsRemoteShutdown": null,
    "userRightsRestoreData": null,
    "userRightsTakeOwnership": null,
    "xboxServicesEnableXboxGameSaveTask": false,
    "xboxServicesAccessoryManagementServiceStartupMode": "manual",
    "xboxServicesLiveAuthManagerServiceStartupMode": "manual",
    "xboxServicesLiveGameSaveServiceStartupMode": "manual",
    "xboxServicesLiveNetworkingServiceStartupMode": "manual",
    "bitLockerSystemDrivePolicy": {
      "encryptionMethod": "aesCbc256",
      "startupAuthenticationRequired": true,
      "startupAuthenticationBlockWithoutTpmChip": false,
      "startupAuthenticationTpmUsage": "required",
      "startupAuthenticationTpmPinUsage": "blocked",
      "startupAuthenticationTpmKeyUsage": "blocked",
      "startupAuthenticationTpmPinAndKeyUsage": "blocked",
      "minimumPinLength": null,
      "recoveryOptions": null,
      "prebootRecoveryEnableMessageAndUrl": true,
      "prebootRecoveryMessage": "TBD",
      "prebootRecoveryUrl": null
    },
    "bitLockerFixedDrivePolicy": {
      "encryptionMethod": "aesCbc256",
      "requireEncryptionForWriteAccess": false,
      "recoveryOptions": {
        "blockDataRecoveryAgent": false,
        "recoveryPasswordUsage": "allowed",
        "recoveryKeyUsage": "blocked",
        "hideRecoveryOptions": false,
        "enableRecoveryInformationSaveToStore": true,
        "recoveryInformationToStore": "passwordAndKey",
        "enableBitLockerAfterRecoveryInformationToStore": false
      }
    },
    "bitLockerRemovableDrivePolicy": {
      "encryptionMethod": "aesCbc256",
      "requireEncryptionForWriteAccess": true,
      "blockCrossOrganizationWriteAccess": false
    },
    "firewallRules": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('4a6c880c-7457-4e98-9e22-a217ad8bdcc8')/microsoft.graph.windows10EndpointProtectionConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windowsDomainJoinConfiguration",
    "id": "09198e6e-e8b0-4e87-964e-40143899eda3",
    "lastModifiedDateTime": "2025-06-11T04:44:52.5543399Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-06-10T23:46:25.1311606Z",
    "description": null,
    "displayName": "ENTRA-HYBRID-CONTOSO",
    "version": 2,
    "computerNameStaticPrefix": "AUTOP-",
    "computerNameSuffixRandomCharCount": 9,
    "activeDirectoryDomainName": "corp.contoso.com",
    "organizationalUnit": "OU=AUTOPILOT-DEVICES-1,OU=DEMOS,DC=corp,DC=contoso,DC=com",
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('09198e6e-e8b0-4e87-964e-40143899eda3')/microsoft.graph.windowsDomainJoinConfiguration/assignments",
    "assignments": [
      {
        "id": "09198e6e-e8b0-4e87-964e-40143899eda3_d2af84fa-a729-4049-961b-924aac2f9f64",
        "source": "direct",
        "sourceId": "09198e6e-e8b0-4e87-964e-40143899eda3",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "d2af84fa-a729-4049-961b-924aac2f9f64"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsHealthMonitoringConfiguration",
    "id": "3b27741c-304a-44ec-ae18-f26bb9a678e5",
    "lastModifiedDateTime": "2025-02-05T21:06:19.879619Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-02-05T21:06:19.879619Z",
    "description": "",
    "displayName": "Intune data collection policy",
    "version": 1,
    "allowDeviceHealthMonitoring": "enabled",
    "configDeviceHealthMonitoringScope": "bootPerformance",
    "configDeviceHealthMonitoringCustomScope": null,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('3b27741c-304a-44ec-ae18-f26bb9a678e5')/microsoft.graph.windowsHealthMonitoringConfiguration/assignments",
    "assignments": [
      {
        "id": "3b27741c-304a-44ec-ae18-f26bb9a678e5_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "3b27741c-304a-44ec-ae18-f26bb9a678e5",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.iosVpnConfiguration",
    "id": "2105ab28-9c50-4174-88bc-780fee3a627b",
    "lastModifiedDateTime": "2025-01-13T17:07:30.1374672Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-01-13T17:07:30.1374672Z",
    "description": null,
    "displayName": "iOS - Device Wide VPN",
    "version": 2,
    "connectionName": "LETSINTUNE Device Wide VPN",
    "connectionType": "microsoftTunnel",
    "loginGroupOrDomain": null,
    "role": null,
    "realm": null,
    "identifier": null,
    "enableSplitTunneling": false,
    "authenticationMethod": "usernameAndPassword",
    "enablePerApp": null,
    "safariDomains": [],
    "providerType": null,
    "associatedDomains": [],
    "excludedDomains": [],
    "disableOnDemandUserOverride": null,
    "disconnectOnIdle": true,
    "disconnectOnIdleTimerInSeconds": null,
    "proxyServer": null,
    "optInToDeviceIdSharing": null,
    "userDomain": null,
    "strictEnforcement": null,
    "cloudName": null,
    "excludeList": [],
    "microsoftTunnelSiteId": "133b58b7-b294-4aa9-8da7-7c4ae62a4cd4",
    "server": {
      "description": "LETSINTUNE – Tunnel Canada",
      "address": "mam-tun-1.letsintune.com:443",
      "isDefaultServer": true
    },
    "customData": [
      {
        "key": "MSTunnelProtectMode",
        "value": "1"
      },
      {
        "key": "PinnedCertificate",
        "value": "MIIDjzCCAnegAwIBAgIQf8RWjJZ4CpdDAWoR2ef1cTANBgkqhkiG9w0BAQsFADBa\nMRMwEQYKCZImiZPyLGQBGRYDY29tMRcwFQYKCZImiZPyLGQBGRYHY29udG9zbzEU\nMBIGCgmSJomT8ixkARkWBGNvcnAxFDASBgNVBAMTC2NvcnAtREMxLUNBMB4XDTI0\nMTIwNDAwMzkyMloXDTI5MTIwNDAwNDkyMVowWjETMBEGCgmSJomT8ixkARkWA2Nv\nbTEXMBUGCgmSJomT8ixkARkWB2NvbnRvc28xFDASBgoJkiaJk/IsZAEZFgRjb3Jw\nMRQwEgYDVQQDEwtjb3JwLURDMS1DQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCC\nAQoCggEBALlzofR6Q9dYxRCHFLZ3JuKmVjg5w1LpRcQyiZx97bikfJHjIPcWPYNs\nTueZuS1lBLJguzxVEMoNyxatetym0FM7DAtCtca/NjZhxUQh997fA0kGvb6ZYrv4\nU84YJC2oIQanM9tcPqZKOFDkuuTvTkh2oetEud0DUN3nMd/iD9LXHkpLsUIoAJs3\nAWdVGMWH/Gx7xB5NWGd8u57E+IoCibIQgyv2eYbI9AZ8TZPb0wbhY+OHgx7yO7Vg\nL4G6yyrf2tbVmPOzFlqCdtKVeXPhriT31Emju8Ut8XV3DAl6byobUcCPsI383fHC\nWtT+5bFeTr5ge2i6DgwZOSeAnguBLCUCAwEAAaNRME8wCwYDVR0PBAQDAgGGMA8G\nA1UdEwEB/wQFMAMBAf8wHQYDVR0OBBYEFPU5VhETyEzSkjl0Uovnqh3x6TlWMBAG\nCSsGAQQBgjcVAQQDAgEAMA0GCSqGSIb3DQEBCwUAA4IBAQBt45injT0sGyIpjN0y\nDX5/VpZKkGHzLLJF1tmcW8iepsTie5Mr8AMIvrUXbxh1zuQKZDVCYmyFu4nE+Muh\nWN7e9LLDj7ipBRpZ5u5sofXwRL0RhAIV2OeBMRWj/qm3xsX3QWrtL+z2B5VSO36O\nLKd16rF+biF33Y9HuAGeAICR7KneEgokrzT188iztGX67nZsLQ01I60BIFl5n6DV\n3m/jcEGuHmnfFDwPOCxKoH6PmbexT8KDB5WQPhJxxpx9vsDRZvRB8skPj0bmNcCE\nUnPhvwuIAiDNEQi/pV6xmtmxT+s1Cc9h8dTYPzhJ8HoJfd0JTBvkeGMrEHmHmv9t\nJTv8"
      }
    ],
    "customKeyValueData": [
      {
        "name": "MSTunnelProtectMode",
        "value": "1"
      },
      {
        "name": "PinnedCertificate",
        "value": "MIIDjzCCAnegAwIBAgIQf8RWjJZ4CpdDAWoR2ef1cTANBgkqhkiG9w0BAQsFADBa\nMRMwEQYKCZImiZPyLGQBGRYDY29tMRcwFQYKCZImiZPyLGQBGRYHY29udG9zbzEU\nMBIGCgmSJomT8ixkARkWBGNvcnAxFDASBgNVBAMTC2NvcnAtREMxLUNBMB4XDTI0\nMTIwNDAwMzkyMloXDTI5MTIwNDAwNDkyMVowWjETMBEGCgmSJomT8ixkARkWA2Nv\nbTEXMBUGCgmSJomT8ixkARkWB2NvbnRvc28xFDASBgoJkiaJk/IsZAEZFgRjb3Jw\nMRQwEgYDVQQDEwtjb3JwLURDMS1DQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCC\nAQoCggEBALlzofR6Q9dYxRCHFLZ3JuKmVjg5w1LpRcQyiZx97bikfJHjIPcWPYNs\nTueZuS1lBLJguzxVEMoNyxatetym0FM7DAtCtca/NjZhxUQh997fA0kGvb6ZYrv4\nU84YJC2oIQanM9tcPqZKOFDkuuTvTkh2oetEud0DUN3nMd/iD9LXHkpLsUIoAJs3\nAWdVGMWH/Gx7xB5NWGd8u57E+IoCibIQgyv2eYbI9AZ8TZPb0wbhY+OHgx7yO7Vg\nL4G6yyrf2tbVmPOzFlqCdtKVeXPhriT31Emju8Ut8XV3DAl6byobUcCPsI383fHC\nWtT+5bFeTr5ge2i6DgwZOSeAnguBLCUCAwEAAaNRME8wCwYDVR0PBAQDAgGGMA8G\nA1UdEwEB/wQFMAMBAf8wHQYDVR0OBBYEFPU5VhETyEzSkjl0Uovnqh3x6TlWMBAG\nCSsGAQQBgjcVAQQDAgEAMA0GCSqGSIb3DQEBCwUAA4IBAQBt45injT0sGyIpjN0y\nDX5/VpZKkGHzLLJF1tmcW8iepsTie5Mr8AMIvrUXbxh1zuQKZDVCYmyFu4nE+Muh\nWN7e9LLDj7ipBRpZ5u5sofXwRL0RhAIV2OeBMRWj/qm3xsX3QWrtL+z2B5VSO36O\nLKd16rF+biF33Y9HuAGeAICR7KneEgokrzT188iztGX67nZsLQ01I60BIFl5n6DV\n3m/jcEGuHmnfFDwPOCxKoH6PmbexT8KDB5WQPhJxxpx9vsDRZvRB8skPj0bmNcCE\nUnPhvwuIAiDNEQi/pV6xmtmxT+s1Cc9h8dTYPzhJ8HoJfd0JTBvkeGMrEHmHmv9t\nJTv8"
      }
    ],
    "onDemandRules": [],
    "targetedMobileApps": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('2105ab28-9c50-4174-88bc-780fee3a627b')/microsoft.graph.iosVpnConfiguration/assignments",
    "assignments": [
      {
        "id": "2105ab28-9c50-4174-88bc-780fee3a627b_399e01ac-c958-49a7-b004-d72361b3c107",
        "source": "direct",
        "sourceId": "2105ab28-9c50-4174-88bc-780fee3a627b",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "399e01ac-c958-49a7-b004-d72361b3c107"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.iosUpdateConfiguration",
    "id": "06496f2a-ad07-4791-870d-b5a271563977",
    "lastModifiedDateTime": "2025-08-26T20:24:59.8639498Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-26T20:24:47.3308805Z",
    "description": "",
    "displayName": "iOS - latest update - behavior",
    "version": 2,
    "isEnabled": false,
    "activeHoursStart": "00:00:00.0000000",
    "activeHoursEnd": "00:00:00.0000000",
    "desiredOsVersion": null,
    "scheduledInstallDays": [],
    "utcTimeOffsetInMinutes": null,
    "enforcedSoftwareUpdateDelayInDays": null,
    "updateScheduleType": "alwaysUpdate",
    "customUpdateTimeWindows": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('06496f2a-ad07-4791-870d-b5a271563977')/microsoft.graph.iosUpdateConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
    "id": "b2fac780-c099-481b-ac53-5d6b1d270926",
    "lastModifiedDateTime": "2025-03-18T17:52:53.4914286Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-03-18T17:52:53.4914286Z",
    "description": "windows 11 24H2",
    "displayName": "LAPS-add-admin-local-windows11-24H2",
    "version": 1,
    "omaSettings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingBoolean",
        "displayName": "Enable Admin Local",
        "description": null,
        "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/AutomaticAccountManagementEnableAccount",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": true
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingBoolean",
        "displayName": "Add automatic account management",
        "description": null,
        "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/AutomaticAccountManagementEnabled",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": true
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Add admin prefix",
        "description": null,
        "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/AutomaticAccountManagementNameOrPrefix",
        "secretReferenceValueId": "38dc9c47-9360-407f-811d-7726b2b6e6c1_b2fac780-c099-481b-ac53-5d6b1d270926_73478cf5-7411-4c08-862d-30cf9db49b85",
        "isEncrypted": true,
        "value": "****"
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingBoolean",
        "displayName": "Add random suffix",
        "description": null,
        "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/AutomaticAccountManagementRandomizeName",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": true
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Add laps admin as local admin",
        "description": null,
        "omaUri": "./Device/Vendor/MSFT/LAPS/Policies/AutomaticAccountManagementTarget",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": 1,
        "isReadOnly": false
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('b2fac780-c099-481b-ac53-5d6b1d270926')/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments": [
      {
        "id": "b2fac780-c099-481b-ac53-5d6b1d270926_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "b2fac780-c099-481b-ac53-5d6b1d270926",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": "26d03c0f-1ad7-4ce7-9171-3910bd48ede8",
          "deviceAndAppManagementAssignmentFilterType": "include"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidWorkProfileVpnConfiguration",
    "id": "26ec4187-b61c-45a4-9bcc-caeaf2f934f3",
    "lastModifiedDateTime": "2025-11-06T20:48:28.7284884Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-11-06T20:48:28.7284884Z",
    "description": null,
    "displayName": "MAM - Tunnel4",
    "version": 2,
    "connectionName": "Tunnel4",
    "connectionType": "microsoftProtect",
    "role": null,
    "realm": null,
    "fingerprint": null,
    "authenticationMethod": "azureAD",
    "proxyServer": null,
    "targetedPackageIds": [
      "com.microsoft.emmx"
    ],
    "alwaysOn": true,
    "alwaysOnLockdown": null,
    "microsoftTunnelSiteId": "d184e381-9428-47fb-9562-d27f79ad503c",
    "proxyExclusionList": [],
    "servers": [
      {
        "description": "Site 4",
        "address": "mam-tun-4.letsintune.com:443",
        "isDefaultServer": true
      }
    ],
    "customData": [
      {
        "key": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "customKeyValueData": [
      {
        "name": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "targetedMobileApps": [
      {
        "name": "Microsoft Edge: AI browser",
        "publisher": "Microsoft Corporation",
        "appStoreUrl": null,
        "appId": "com.microsoft.emmx"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('26ec4187-b61c-45a4-9bcc-caeaf2f934f3')/microsoft.graph.androidWorkProfileVpnConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidWorkProfileVpnConfiguration",
    "id": "ed2f1303-a94e-4d36-95c6-00154cea4a47",
    "lastModifiedDateTime": "2025-12-16T15:26:26.6864506Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-12-16T15:26:26.6864506Z",
    "description": "Personal",
    "displayName": "MAM-Tunnel4",
    "version": 1,
    "connectionName": "MAMTunnel4",
    "connectionType": "microsoftProtect",
    "role": null,
    "realm": null,
    "fingerprint": null,
    "authenticationMethod": "azureAD",
    "proxyServer": null,
    "targetedPackageIds": [
      "com.microsoft.emmx"
    ],
    "alwaysOn": true,
    "alwaysOnLockdown": null,
    "microsoftTunnelSiteId": "d184e381-9428-47fb-9562-d27f79ad503c",
    "proxyExclusionList": [],
    "servers": [
      {
        "description": "Site 4",
        "address": "mam-tun-4.letsintune.com:443",
        "isDefaultServer": true
      }
    ],
    "customData": [
      {
        "key": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "customKeyValueData": [
      {
        "name": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "targetedMobileApps": [
      {
        "name": "Microsoft Edge: AI browser",
        "publisher": "Microsoft Corporation",
        "appStoreUrl": null,
        "appId": "com.microsoft.emmx"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('ed2f1303-a94e-4d36-95c6-00154cea4a47')/microsoft.graph.androidWorkProfileVpnConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windows10PkcsCertificateProfile",
    "id": "6f5b169f-9690-40e2-9f63-83c4532df4dc",
    "lastModifiedDateTime": "2025-07-22T17:43:48.9366625Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-07-22T17:43:48.9366625Z",
    "description": null,
    "displayName": "PKCS for Windows",
    "version": 1,
    "renewalThresholdPercentage": 20,
    "keyStorageProvider": "useTpmKspOtherwiseUseSoftwareKsp",
    "subjectNameFormat": "custom",
    "subjectAlternativeNameType": "none",
    "certificateValidityPeriodValue": 1,
    "certificateValidityPeriodScale": "years",
    "certificationAuthority": "DC1.corp.contoso.com",
    "certificationAuthorityName": "corp-DC1-CA",
    "certificateTemplateName": "PFX Template",
    "subjectAlternativeNameFormatString": null,
    "subjectNameFormatString": "CN={{AAD_Device_ID}}",
    "certificateStore": "machine",
    "extendedKeyUsages": [
      {
        "name": "Client Authentication",
        "objectIdentifier": "1.3.6.1.5.5.7.3.2"
      }
    ],
    "customSubjectAlternativeNames": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('6f5b169f-9690-40e2-9f63-83c4532df4dc')/microsoft.graph.windows10PkcsCertificateProfile/assignments",
    "assignments": [
      {
        "id": "6f5b169f-9690-40e2-9f63-83c4532df4dc_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "6f5b169f-9690-40e2-9f63-83c4532df4dc",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerTrustedRootCertificate",
    "id": "4a42c33a-0c42-4060-afa7-4059d118b5a6",
    "lastModifiedDateTime": "2025-07-22T17:10:05.1291037Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-01-15T06:27:22.8110589Z",
    "description": null,
    "displayName": "Root CA for Android",
    "version": 4,
    "trustedRootCertificate": "MIIDjzCCAnegAwIBAgIQf8RWjJZ4CpdDAWoR2ef1cTANBgkqhkiG9w0BAQsFADBaMRMwEQYKCZImiZPyLGQBGRYDY29tMRcwFQYKCZImiZPyLGQBGRYHY29udG9zbzEUMBIGCgmSJomT8ixkARkWBGNvcnAxFDASBgNVBAMTC2NvcnAtREMxLUNBMB4XDTI0MTIwNDAwMzkyMloXDTI5MTIwNDAwNDkyMVowWjETMBEGCgmSJomT8ixkARkWA2NvbTEXMBUGCgmSJomT8ixkARkWB2NvbnRvc28xFDASBgoJkiaJk/IsZAEZFgRjb3JwMRQwEgYDVQQDEwtjb3JwLURDMS1DQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALlzofR6Q9dYxRCHFLZ3JuKmVjg5w1LpRcQyiZx97bikfJHjIPcWPYNsTueZuS1lBLJguzxVEMoNyxatetym0FM7DAtCtca/NjZhxUQh997fA0kGvb6ZYrv4U84YJC2oIQanM9tcPqZKOFDkuuTvTkh2oetEud0DUN3nMd/iD9LXHkpLsUIoAJs3AWdVGMWH/Gx7xB5NWGd8u57E+IoCibIQgyv2eYbI9AZ8TZPb0wbhY+OHgx7yO7VgL4G6yyrf2tbVmPOzFlqCdtKVeXPhriT31Emju8Ut8XV3DAl6byobUcCPsI383fHCWtT+5bFeTr5ge2i6DgwZOSeAnguBLCUCAwEAAaNRME8wCwYDVR0PBAQDAgGGMA8GA1UdEwEB/wQFMAMBAf8wHQYDVR0OBBYEFPU5VhETyEzSkjl0Uovnqh3x6TlWMBAGCSsGAQQBgjcVAQQDAgEAMA0GCSqGSIb3DQEBCwUAA4IBAQBt45injT0sGyIpjN0yDX5/VpZKkGHzLLJF1tmcW8iepsTie5Mr8AMIvrUXbxh1zuQKZDVCYmyFu4nE+MuhWN7e9LLDj7ipBRpZ5u5sofXwRL0RhAIV2OeBMRWj/qm3xsX3QWrtL+z2B5VSO36OLKd16rF+biF33Y9HuAGeAICR7KneEgokrzT188iztGX67nZsLQ01I60BIFl5n6DV3m/jcEGuHmnfFDwPOCxKoH6PmbexT8KDB5WQPhJxxpx9vsDRZvRB8skPj0bmNcCEUnPhvwuIAiDNEQi/pV6xmtmxT+s1Cc9h8dTYPzhJ8HoJfd0JTBvkeGMrEHmHmv9tJTv8",
    "certFileName": "ROOTCA.cer",
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('4a42c33a-0c42-4060-afa7-4059d118b5a6')/microsoft.graph.androidDeviceOwnerTrustedRootCertificate/assignments",
    "assignments": [
      {
        "id": "4a42c33a-0c42-4060-afa7-4059d118b5a6_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "4a42c33a-0c42-4060-afa7-4059d118b5a6",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.iosTrustedRootCertificate",
    "id": "27c0dd2c-e3bc-4fc2-9e4c-504c76725eab",
    "lastModifiedDateTime": "2025-07-22T17:10:34.3176255Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-01-14T17:35:24.5493863Z",
    "description": "from ADCS",
    "displayName": "Root CA for iOS",
    "version": 3,
    "trustedRootCertificate": "MIIDjzCCAnegAwIBAgIQf8RWjJZ4CpdDAWoR2ef1cTANBgkqhkiG9w0BAQsFADBaMRMwEQYKCZImiZPyLGQBGRYDY29tMRcwFQYKCZImiZPyLGQBGRYHY29udG9zbzEUMBIGCgmSJomT8ixkARkWBGNvcnAxFDASBgNVBAMTC2NvcnAtREMxLUNBMB4XDTI0MTIwNDAwMzkyMloXDTI5MTIwNDAwNDkyMVowWjETMBEGCgmSJomT8ixkARkWA2NvbTEXMBUGCgmSJomT8ixkARkWB2NvbnRvc28xFDASBgoJkiaJk/IsZAEZFgRjb3JwMRQwEgYDVQQDEwtjb3JwLURDMS1DQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALlzofR6Q9dYxRCHFLZ3JuKmVjg5w1LpRcQyiZx97bikfJHjIPcWPYNsTueZuS1lBLJguzxVEMoNyxatetym0FM7DAtCtca/NjZhxUQh997fA0kGvb6ZYrv4U84YJC2oIQanM9tcPqZKOFDkuuTvTkh2oetEud0DUN3nMd/iD9LXHkpLsUIoAJs3AWdVGMWH/Gx7xB5NWGd8u57E+IoCibIQgyv2eYbI9AZ8TZPb0wbhY+OHgx7yO7VgL4G6yyrf2tbVmPOzFlqCdtKVeXPhriT31Emju8Ut8XV3DAl6byobUcCPsI383fHCWtT+5bFeTr5ge2i6DgwZOSeAnguBLCUCAwEAAaNRME8wCwYDVR0PBAQDAgGGMA8GA1UdEwEB/wQFMAMBAf8wHQYDVR0OBBYEFPU5VhETyEzSkjl0Uovnqh3x6TlWMBAGCSsGAQQBgjcVAQQDAgEAMA0GCSqGSIb3DQEBCwUAA4IBAQBt45injT0sGyIpjN0yDX5/VpZKkGHzLLJF1tmcW8iepsTie5Mr8AMIvrUXbxh1zuQKZDVCYmyFu4nE+MuhWN7e9LLDj7ipBRpZ5u5sofXwRL0RhAIV2OeBMRWj/qm3xsX3QWrtL+z2B5VSO36OLKd16rF+biF33Y9HuAGeAICR7KneEgokrzT188iztGX67nZsLQ01I60BIFl5n6DV3m/jcEGuHmnfFDwPOCxKoH6PmbexT8KDB5WQPhJxxpx9vsDRZvRB8skPj0bmNcCEUnPhvwuIAiDNEQi/pV6xmtmxT+s1Cc9h8dTYPzhJ8HoJfd0JTBvkeGMrEHmHmv9tJTv8",
    "certFileName": "ROOTCA.cer",
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('27c0dd2c-e3bc-4fc2-9e4c-504c76725eab')/microsoft.graph.iosTrustedRootCertificate/assignments",
    "assignments": [
      {
        "id": "27c0dd2c-e3bc-4fc2-9e4c-504c76725eab_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "27c0dd2c-e3bc-4fc2-9e4c-504c76725eab",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows81TrustedRootCertificate",
    "id": "761bb174-dfc1-475b-8181-1f594779d081",
    "lastModifiedDateTime": "2025-07-22T17:10:20.2504693Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-03-17T21:03:59.9226742Z",
    "description": null,
    "displayName": "Root CA for Windows",
    "version": 2,
    "trustedRootCertificate": "MIIDjzCCAnegAwIBAgIQf8RWjJZ4CpdDAWoR2ef1cTANBgkqhkiG9w0BAQsFADBaMRMwEQYKCZImiZPyLGQBGRYDY29tMRcwFQYKCZImiZPyLGQBGRYHY29udG9zbzEUMBIGCgmSJomT8ixkARkWBGNvcnAxFDASBgNVBAMTC2NvcnAtREMxLUNBMB4XDTI0MTIwNDAwMzkyMloXDTI5MTIwNDAwNDkyMVowWjETMBEGCgmSJomT8ixkARkWA2NvbTEXMBUGCgmSJomT8ixkARkWB2NvbnRvc28xFDASBgoJkiaJk/IsZAEZFgRjb3JwMRQwEgYDVQQDEwtjb3JwLURDMS1DQTCCASIwDQYJKoZIhvcNAQEBBQADggEPADCCAQoCggEBALlzofR6Q9dYxRCHFLZ3JuKmVjg5w1LpRcQyiZx97bikfJHjIPcWPYNsTueZuS1lBLJguzxVEMoNyxatetym0FM7DAtCtca/NjZhxUQh997fA0kGvb6ZYrv4U84YJC2oIQanM9tcPqZKOFDkuuTvTkh2oetEud0DUN3nMd/iD9LXHkpLsUIoAJs3AWdVGMWH/Gx7xB5NWGd8u57E+IoCibIQgyv2eYbI9AZ8TZPb0wbhY+OHgx7yO7VgL4G6yyrf2tbVmPOzFlqCdtKVeXPhriT31Emju8Ut8XV3DAl6byobUcCPsI383fHCWtT+5bFeTr5ge2i6DgwZOSeAnguBLCUCAwEAAaNRME8wCwYDVR0PBAQDAgGGMA8GA1UdEwEB/wQFMAMBAf8wHQYDVR0OBBYEFPU5VhETyEzSkjl0Uovnqh3x6TlWMBAGCSsGAQQBgjcVAQQDAgEAMA0GCSqGSIb3DQEBCwUAA4IBAQBt45injT0sGyIpjN0yDX5/VpZKkGHzLLJF1tmcW8iepsTie5Mr8AMIvrUXbxh1zuQKZDVCYmyFu4nE+MuhWN7e9LLDj7ipBRpZ5u5sofXwRL0RhAIV2OeBMRWj/qm3xsX3QWrtL+z2B5VSO36OLKd16rF+biF33Y9HuAGeAICR7KneEgokrzT188iztGX67nZsLQ01I60BIFl5n6DV3m/jcEGuHmnfFDwPOCxKoH6PmbexT8KDB5WQPhJxxpx9vsDRZvRB8skPj0bmNcCEUnPhvwuIAiDNEQi/pV6xmtmxT+s1Cc9h8dTYPzhJ8HoJfd0JTBvkeGMrEHmHmv9tJTv8",
    "certFileName": "ROOT.crt",
    "destinationStore": "computerCertStoreRoot",
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('761bb174-dfc1-475b-8181-1f594779d081')/microsoft.graph.windows81TrustedRootCertificate/assignments",
    "assignments": [
      {
        "id": "761bb174-dfc1-475b-8181-1f594779d081_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "761bb174-dfc1-475b-8181-1f594779d081",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.iosScepCertificateProfile",
    "id": "bf3f796a-8353-4920-a428-d3ff29aaf2ea",
    "lastModifiedDateTime": "2025-08-13T17:02:27.936151Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-13T16:56:00.922453Z",
    "description": "Device",
    "displayName": "SCEP Device Request for iOS",
    "version": 3,
    "renewalThresholdPercentage": 20,
    "subjectNameFormat": "custom",
    "subjectAlternativeNameType": null,
    "certificateValidityPeriodValue": 1,
    "certificateValidityPeriodScale": "years",
    "scepServerUrls": [
      "https://{{CloudPKIFQDN}}/TrafficGateway/PassThroughRoutingService/CloudPki/CloudPkiService/Scep/38dc9c47-9360-407f-811d-7726b2b6e6c1/da072a11-8444-4e9e-b1a1-fc11eb2363e0"
    ],
    "subjectNameFormatString": "CN={{AAD_Device_ID}}",
    "keyUsage": "keyEncipherment,digitalSignature",
    "keySize": "size2048",
    "subjectAlternativeNameFormatString": null,
    "certificateStore": "machine",
    "extendedKeyUsages": [
      {
        "name": "Client Authentication",
        "objectIdentifier": "1.3.6.1.5.5.7.3.2"
      }
    ],
    "customSubjectAlternativeNames": [
      {
        "sanType": "universalResourceIdentifier",
        "name": "IntuneDeviceId://{{DeviceID}}"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('bf3f796a-8353-4920-a428-d3ff29aaf2ea')/microsoft.graph.iosScepCertificateProfile/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windows81SCEPCertificateProfile",
    "id": "cd58c378-5d09-44f3-92e7-d134608a0d24",
    "lastModifiedDateTime": "2025-06-24T16:40:49.9737767Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-03-18T16:17:32.3637149Z",
    "description": null,
    "displayName": "SCEP-Certificate-Device",
    "version": 5,
    "renewalThresholdPercentage": 20,
    "keyStorageProvider": "useTpmKspOtherwiseUseSoftwareKsp",
    "subjectNameFormat": "custom",
    "subjectAlternativeNameType": "none",
    "certificateValidityPeriodValue": 1,
    "certificateValidityPeriodScale": "years",
    "scepServerUrls": [
      "https://ndes-mngenvmcap746883.msappproxy.net/certsrv/mscep/mscep.dll/"
    ],
    "subjectNameFormatString": "CN={{FullyQualifiedDomainName}}",
    "keyUsage": "keyEncipherment,digitalSignature",
    "keySize": "size2048",
    "hashAlgorithm": "sha2",
    "subjectAlternativeNameFormatString": null,
    "certificateStore": "machine",
    "extendedKeyUsages": [
      {
        "name": "Client Authentication",
        "objectIdentifier": "1.3.6.1.5.5.7.3.2"
      }
    ],
    "customSubjectAlternativeNames": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('cd58c378-5d09-44f3-92e7-d134608a0d24')/microsoft.graph.windows81SCEPCertificateProfile/assignments",
    "assignments": [
      {
        "id": "cd58c378-5d09-44f3-92e7-d134608a0d24_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "cd58c378-5d09-44f3-92e7-d134608a0d24",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows81SCEPCertificateProfile",
    "id": "5a3f04a4-7560-4491-bb03-6c9f13b8c324",
    "lastModifiedDateTime": "2025-06-24T16:41:02.0937183Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-03-17T21:05:33.0363813Z",
    "description": "User cert SCEP",
    "displayName": "SCEP-Certificate-User",
    "version": 4,
    "renewalThresholdPercentage": 20,
    "keyStorageProvider": "useTpmKspOtherwiseUseSoftwareKsp",
    "subjectNameFormat": "custom",
    "subjectAlternativeNameType": "none",
    "certificateValidityPeriodValue": 1,
    "certificateValidityPeriodScale": "years",
    "scepServerUrls": [
      "https://ndes-mngenvmcap746883.msappproxy.net/certsrv/mscep/mscep.dll/"
    ],
    "subjectNameFormatString": "CN={{UserName}},E={{EmailAddress}}",
    "keyUsage": "keyEncipherment,digitalSignature",
    "keySize": "size2048",
    "hashAlgorithm": "sha2",
    "subjectAlternativeNameFormatString": null,
    "certificateStore": "user",
    "extendedKeyUsages": [
      {
        "name": "Client Authentication",
        "objectIdentifier": "1.3.6.1.5.5.7.3.2"
      }
    ],
    "customSubjectAlternativeNames": [
      {
        "sanType": "userPrincipalName",
        "name": "CN={{UserPrincipalName}}"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('5a3f04a4-7560-4491-bb03-6c9f13b8c324')/microsoft.graph.windows81SCEPCertificateProfile/assignments",
    "assignments": [
      {
        "id": "5a3f04a4-7560-4491-bb03-6c9f13b8c324_acacacac-9df4-4c7d-9d50-4ef0226f57a9",
        "source": "direct",
        "sourceId": "5a3f04a4-7560-4491-bb03-6c9f13b8c324",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allLicensedUsersAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
    "id": "dc7636b8-e229-4410-8481-b8a8693c4f66",
    "lastModifiedDateTime": "2025-10-22T02:58:53.0137583Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-10-22T02:58:53.0137583Z",
    "description": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Audio/IPProtocolMatchCondition",
    "displayName": "Teams - Audio Video ScreenSharing",
    "version": 1,
    "omaSettings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Audio",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Audio/IPProtocolMatchCondition",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": 17,
        "isReadOnly": false
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Audio1",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Audio/IPPortMatchCondition",
        "secretReferenceValueId": "38dc9c47-9360-407f-811d-7726b2b6e6c1_dc7636b8-e229-4410-8481-b8a8693c4f66_07bc13ee-f5b8-4e7a-8538-ba3628172a69",
        "isEncrypted": true,
        "value": "****"
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Audio2",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Audio/DSCPAction",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": 46,
        "isReadOnly": false
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Video",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Video/IPProtocolMatchConditio",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": 17,
        "isReadOnly": false
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Video1",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Video/IPPortMatchCondition",
        "secretReferenceValueId": "38dc9c47-9360-407f-811d-7726b2b6e6c1_dc7636b8-e229-4410-8481-b8a8693c4f66_91725156-1ede-47fa-b842-667f14497d6c",
        "isEncrypted": true,
        "value": "****"
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Video2",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Video/DSCPAction",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": 34,
        "isReadOnly": false
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Screen Sharing",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Sharing/IPProtocolMatchCondition",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": 17,
        "isReadOnly": false
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Screen Sharing1",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Sharing/IPPortMatchCondition",
        "secretReferenceValueId": "38dc9c47-9360-407f-811d-7726b2b6e6c1_dc7636b8-e229-4410-8481-b8a8693c4f66_73b95378-a63b-4609-a1b2-e4f01ade8cd3",
        "isEncrypted": true,
        "value": "****"
      },
      {
        "@odata.type": "#microsoft.graph.omaSettingInteger",
        "displayName": "Screen Sharing2",
        "description": null,
        "omaUri": "./Vendor/MSFT/Policy/Config/NetworkQoSPolicy/Teams_Sharing/DSCPAction",
        "secretReferenceValueId": null,
        "isEncrypted": false,
        "value": 18,
        "isReadOnly": false
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('dc7636b8-e229-4410-8481-b8a8693c4f66')/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windows10CustomConfiguration",
    "id": "3650c48d-d476-494e-b4f7-c85baff2fb66",
    "lastModifiedDateTime": "2025-10-22T18:18:10.7542425Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-10-22T18:18:10.7542425Z",
    "description": null,
    "displayName": "TEAMS QOS",
    "version": 1,
    "omaSettings": [
      {
        "@odata.type": "#microsoft.graph.omaSettingString",
        "displayName": "Teams Audio: Application",
        "description": "Teams executable name.",
        "omaUri": "./Device/Vendor/MSFT/NetworkQoSPolicy/TeamsAudio/AppPathNameMatchCondition",
        "secretReferenceValueId": "38dc9c47-9360-407f-811d-7726b2b6e6c1_3650c48d-d476-494e-b4f7-c85baff2fb66_8fbf01de-f101-455b-8af7-37d45d272a10",
        "isEncrypted": true,
        "value": "****"
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('3650c48d-d476-494e-b4f7-c85baff2fb66')/microsoft.graph.windows10CustomConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerVpnConfiguration",
    "id": "4dd36b84-ad0b-48b1-9317-184d78f0ef93",
    "lastModifiedDateTime": "2025-08-06T17:44:12.3114442Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-06T17:44:12.3114442Z",
    "description": "",
    "displayName": "Tunnel4",
    "version": 2,
    "authenticationMethod": "azureAD",
    "connectionName": "Tunnel4",
    "role": null,
    "realm": null,
    "connectionType": "microsoftProtect",
    "proxyServer": null,
    "targetedPackageIds": [
      "com.microsoft.emmx"
    ],
    "alwaysOn": true,
    "alwaysOnLockdown": null,
    "microsoftTunnelSiteId": "d184e381-9428-47fb-9562-d27f79ad503c",
    "proxyExclusionList": [],
    "servers": [
      {
        "description": "Site 4",
        "address": "mam-tun-4.letsintune.com:443",
        "isDefaultServer": true
      }
    ],
    "targetedMobileApps": [
      {
        "name": "Microsoft Edge: AI browser",
        "publisher": "Microsoft Corporation",
        "appStoreUrl": null,
        "appId": "com.microsoft.emmx"
      }
    ],
    "customData": [
      {
        "key": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "customKeyValueData": [
      {
        "name": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('4dd36b84-ad0b-48b1-9317-184d78f0ef93')/microsoft.graph.androidDeviceOwnerVpnConfiguration/assignments",
    "assignments": [
      {
        "id": "4dd36b84-ad0b-48b1-9317-184d78f0ef93_399e01ac-c958-49a7-b004-d72361b3c107",
        "source": "direct",
        "sourceId": "4dd36b84-ad0b-48b1-9317-184d78f0ef93",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "399e01ac-c958-49a7-b004-d72361b3c107"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.androidWorkProfileVpnConfiguration",
    "id": "06935be9-db22-436d-af3b-b6d4815ae070",
    "lastModifiedDateTime": "2025-09-19T16:15:34.5038482Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-09-19T16:15:34.5038482Z",
    "description": "Android Enterprise\nPersonally Owned",
    "displayName": "Tunnel5",
    "version": 1,
    "connectionName": "Tunnel5",
    "connectionType": "microsoftProtect",
    "role": null,
    "realm": null,
    "fingerprint": null,
    "authenticationMethod": "azureAD",
    "proxyServer": null,
    "targetedPackageIds": [],
    "alwaysOn": false,
    "alwaysOnLockdown": null,
    "microsoftTunnelSiteId": "92011947-911e-45a3-863b-978ae597e508",
    "proxyExclusionList": [],
    "servers": [
      {
        "description": "Site 5",
        "address": "mam-tun-1.letsintune.com:443",
        "isDefaultServer": true
      }
    ],
    "customData": [
      {
        "key": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "customKeyValueData": [
      {
        "name": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "targetedMobileApps": [],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('06935be9-db22-436d-af3b-b6d4815ae070')/microsoft.graph.androidWorkProfileVpnConfiguration/assignments",
    "assignments": [
      {
        "id": "06935be9-db22-436d-af3b-b6d4815ae070_adadadad-808e-44e2-905a-0b7873a8a531",
        "source": "direct",
        "sourceId": "06935be9-db22-436d-af3b-b6d4815ae070",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.allDevicesAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "5512dffb-8d9a-43de-b4d0-20ca91ba4f52",
    "lastModifiedDateTime": "2025-08-01T15:19:54.063542Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-01T15:19:54.063542Z",
    "description": "Update ring 1 (Global)",
    "displayName": "Update ring 1",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAtMaintenanceTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 30,
    "featureUpdatesDeferralPeriodInDays": 7,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 10,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 30,
    "deadlineForQualityUpdatesInDays": 7,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "enabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
      "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
      "activeHoursStart": "08:00:00.0000000",
      "activeHoursEnd": "22:00:00.0000000"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('5512dffb-8d9a-43de-b4d0-20ca91ba4f52')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "a4aebeda-36a7-418b-83fe-665f1667c8f5",
    "lastModifiedDateTime": "2025-08-07T04:48:14.9054332Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-07T04:48:14.9054332Z",
    "description": "Deploy to general user population\t",
    "displayName": "UpdateRing_Broad",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAtMaintenanceTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 7,
    "featureUpdatesDeferralPeriodInDays": 30,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 10,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 7,
    "deadlineForQualityUpdatesInDays": 7,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "enabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
      "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
      "activeHoursStart": "08:00:00.0000000",
      "activeHoursEnd": "17:00:00.0000000"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('a4aebeda-36a7-418b-83fe-665f1667c8f5')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "3e463235-1287-473a-b81e-1e4158db4e5f",
    "lastModifiedDateTime": "2025-08-07T04:49:19.1101095Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-07T04:49:19.1101095Z",
    "description": "Delay for sensitive environments\nExecutives, critical systems",
    "displayName": "UpdateRing_Late",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAtMaintenanceTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 21,
    "featureUpdatesDeferralPeriodInDays": 60,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 10,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 7,
    "deadlineForQualityUpdatesInDays": 7,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "enabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
      "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
      "activeHoursStart": "08:00:00.0000000",
      "activeHoursEnd": "17:00:00.0000000"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('3e463235-1287-473a-b81e-1e4158db4e5f')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "db6d37b3-6d2e-4012-b6b7-9e21226736fe",
    "lastModifiedDateTime": "2025-08-07T04:47:17.4151311Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-07T04:47:17.4151311Z",
    "description": "Test updates early\t",
    "displayName": "UpdateRing_Pilot",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAtMaintenanceTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": true,
    "qualityUpdatesDeferralPeriodInDays": 0,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 10,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 7,
    "deadlineForQualityUpdatesInDays": 7,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "enabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
      "@odata.type": "#microsoft.graph.windowsUpdateActiveHoursInstall",
      "activeHoursStart": "08:00:00.0000000",
      "activeHoursEnd": "17:00:00.0000000"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('db6d37b3-6d2e-4012-b6b7-9e21226736fe')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.androidDeviceOwnerVpnConfiguration",
    "id": "1d3548d5-ce11-42d5-b4c0-da78a2285dca",
    "lastModifiedDateTime": "2025-09-19T14:28:42.4465731Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-09-19T14:28:42.4465731Z",
    "description": null,
    "displayName": "VPN 1",
    "version": 2,
    "authenticationMethod": "azureAD",
    "connectionName": "PAT TD",
    "role": null,
    "realm": null,
    "connectionType": "microsoftProtect",
    "proxyServer": null,
    "targetedPackageIds": [
      "com.microsoft.emmx"
    ],
    "alwaysOn": true,
    "alwaysOnLockdown": null,
    "microsoftTunnelSiteId": "d184e381-9428-47fb-9562-d27f79ad503c",
    "proxyExclusionList": [],
    "servers": [
      {
        "description": "Site 4",
        "address": "mam-tun-4.letsintune.com:443",
        "isDefaultServer": true
      }
    ],
    "targetedMobileApps": [
      {
        "name": "Microsoft Edge: AI browser",
        "publisher": "Microsoft Corporation",
        "appStoreUrl": null,
        "appId": "com.microsoft.emmx"
      }
    ],
    "customData": [
      {
        "key": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "customKeyValueData": [
      {
        "name": "MicrosoftDefenderAppSettings",
        "value": null
      }
    ],
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('1d3548d5-ce11-42d5-b4c0-da78a2285dca')/microsoft.graph.androidDeviceOwnerVpnConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "3ad78eac-750c-4f73-920c-ddd2ddcfeedb",
    "lastModifiedDateTime": "2025-10-22T17:54:13.7445788Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-10-22T17:54:13.7445788Z",
    "description": "Devices in this ring recieve updates immediately after release with 1 day grace period before a forced reboot.",
    "displayName": "Win - OIB - WUfB - Ring 1 - Pilot - v3.0",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "windowsDefault",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "installationSchedule": null,
    "qualityUpdatesDeferralPeriodInDays": 0,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": false,
    "featureUpdatesWillBeRolledBack": false,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 0,
    "deadlineForQualityUpdatesInDays": 0,
    "deadlineGracePeriodInDays": 1,
    "postponeRebootUntilAfterDeadline": true,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('3ad78eac-750c-4f73-920c-ddd2ddcfeedb')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "ef6fdeab-f490-4a2e-9c56-4769689a9e81",
    "lastModifiedDateTime": "2025-10-22T17:54:13.9728401Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-10-22T17:54:13.9728401Z",
    "description": "Devices in this ring receive updates 3 days after release and have a 0-day deadline on install with 2 day grace period before a forced reboot.",
    "displayName": "Win - OIB - WUfB - Ring 2 - UAT - v3.0",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "windowsDefault",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "installationSchedule": null,
    "qualityUpdatesDeferralPeriodInDays": 3,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": false,
    "featureUpdatesWillBeRolledBack": false,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 0,
    "deadlineForQualityUpdatesInDays": 0,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": true,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('ef6fdeab-f490-4a2e-9c56-4769689a9e81')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "24a5107b-de6c-4f43-a509-12f73d94fbe2",
    "lastModifiedDateTime": "2025-10-22T17:54:14.271355Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-10-22T17:54:14.271355Z",
    "description": "Devices in this ring receive updates 10 days after release and have a 2-day deadline on install with 1 day grace period before a forced reboot.",
    "displayName": "Win - OIB - WUfB - Ring 3 - Production - v3.0",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "windowsDefault",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "installationSchedule": null,
    "qualityUpdatesDeferralPeriodInDays": 10,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": false,
    "featureUpdatesWillBeRolledBack": false,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 2,
    "deadlineForQualityUpdatesInDays": 2,
    "deadlineGracePeriodInDays": 1,
    "postponeRebootUntilAfterDeadline": true,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "enabled",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('24a5107b-de6c-4f43-a509-12f73d94fbe2')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": []
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "2630c018-a7ac-4566-90fb-1ff8cee2f0ae",
    "lastModifiedDateTime": "2025-08-12T03:06:56.3927036Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-12T03:06:56.3927036Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Global Autopatch - Last",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "windowsDefault",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "installationSchedule": null,
    "qualityUpdatesDeferralPeriodInDays": 10,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 5,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('2630c018-a7ac-4566-90fb-1ff8cee2f0ae')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "2630c018-a7ac-4566-90fb-1ff8cee2f0ae_3a90d004-604a-4449-8863-237029df687c",
        "source": "direct",
        "sourceId": "2630c018-a7ac-4566-90fb-1ff8cee2f0ae",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "3a90d004-604a-4449-8863-237029df687c"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "ac9fdbb6-62ca-4841-9f3c-a6f421ec613a",
    "lastModifiedDateTime": "2025-08-12T03:06:55.7887178Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-12T03:06:55.7887178Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Global Autopatch - Ring1",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "windowsDefault",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "installationSchedule": null,
    "qualityUpdatesDeferralPeriodInDays": 1,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 2,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('ac9fdbb6-62ca-4841-9f3c-a6f421ec613a')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "ac9fdbb6-62ca-4841-9f3c-a6f421ec613a_bcb75649-5cb2-47c9-af3c-681c08aeb867",
        "source": "direct",
        "sourceId": "ac9fdbb6-62ca-4841-9f3c-a6f421ec613a",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "bcb75649-5cb2-47c9-af3c-681c08aeb867"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "c79b5e18-eeec-4e85-87e8-18e65687a781",
    "lastModifiedDateTime": "2025-08-12T03:06:55.8659252Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-12T03:06:55.8659252Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Global Autopatch - Ring2",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "windowsDefault",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "installationSchedule": null,
    "qualityUpdatesDeferralPeriodInDays": 5,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 3,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('c79b5e18-eeec-4e85-87e8-18e65687a781')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "c79b5e18-eeec-4e85-87e8-18e65687a781_a41bd673-5d66-4dd4-ab5c-4dada93e75e8",
        "source": "direct",
        "sourceId": "c79b5e18-eeec-4e85-87e8-18e65687a781",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "a41bd673-5d66-4dd4-ab5c-4dada93e75e8"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "e5b816ff-8333-497d-a50f-354559020379",
    "lastModifiedDateTime": "2025-08-12T03:06:56.3452673Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-12T03:06:56.3452673Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Global Autopatch - Ring3",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "windowsDefault",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "installationSchedule": null,
    "qualityUpdatesDeferralPeriodInDays": 9,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 5,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('e5b816ff-8333-497d-a50f-354559020379')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "e5b816ff-8333-497d-a50f-354559020379_1a31a6b0-d2c8-4711-a596-82d0d3151f43",
        "source": "direct",
        "sourceId": "e5b816ff-8333-497d-a50f-354559020379",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "1a31a6b0-d2c8-4711-a596-82d0d3151f43"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "d9129116-d1e0-4662-aa2a-e100c18e25ce",
    "lastModifiedDateTime": "2025-08-12T03:06:55.7305267Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-12T03:06:55.7305267Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Global Autopatch - Test",
    "version": 1,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "windowsDefault",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "installationSchedule": null,
    "qualityUpdatesDeferralPeriodInDays": 0,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": null,
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 1,
    "deadlineGracePeriodInDays": 0,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('d9129116-d1e0-4662-aa2a-e100c18e25ce')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "d9129116-d1e0-4662-aa2a-e100c18e25ce_3df1c11e-c935-48a4-9911-50ca4c5142fb",
        "source": "direct",
        "sourceId": "d9129116-d1e0-4662-aa2a-e100c18e25ce",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "3df1c11e-c935-48a4-9911-50ca4c5142fb"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "fe455e75-d763-4265-a754-5a7e8042d29f",
    "lastModifiedDateTime": "2025-08-12T12:20:43.7985318Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-01T16:20:22.4771594Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Weekend Ring 1 - Last",
    "version": 7,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAndRebootAtScheduledTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 1,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": "everyWeek",
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 2,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
      "@odata.type": "#microsoft.graph.windowsUpdateScheduledInstall",
      "scheduledInstallDay": "sunday",
      "scheduledInstallTime": "03:00:00.0000000"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('fe455e75-d763-4265-a754-5a7e8042d29f')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "fe455e75-d763-4265-a754-5a7e8042d29f_eb3c1911-36d9-4139-9e73-3a8df91b9654",
        "source": "direct",
        "sourceId": "fe455e75-d763-4265-a754-5a7e8042d29f",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "eb3c1911-36d9-4139-9e73-3a8df91b9654"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "c9e840b8-1798-434f-88cf-b731e59eefd7",
    "lastModifiedDateTime": "2025-08-12T12:20:43.3489681Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-01T16:41:25.9873387Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Weekend Ring 1 - Ring1",
    "version": 6,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAndRebootAtScheduledTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 1,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": "everyWeek",
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 2,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
      "@odata.type": "#microsoft.graph.windowsUpdateScheduledInstall",
      "scheduledInstallDay": "saturday",
      "scheduledInstallTime": "03:00:00.0000000"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('c9e840b8-1798-434f-88cf-b731e59eefd7')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "c9e840b8-1798-434f-88cf-b731e59eefd7_27004dd4-b986-4c69-9ed5-a553dcbca818",
        "source": "direct",
        "sourceId": "c9e840b8-1798-434f-88cf-b731e59eefd7",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "27004dd4-b986-4c69-9ed5-a553dcbca818"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "7831a3a0-2e72-484c-bd77-4703e5629726",
    "lastModifiedDateTime": "2025-08-12T12:20:43.4737571Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-01T17:21:10.3958381Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Weekend Ring 1 - Ring2",
    "version": 3,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAndRebootAtScheduledTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 1,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": "everyWeek",
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 2,
    "deadlineGracePeriodInDays": 2,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
      "@odata.type": "#microsoft.graph.windowsUpdateScheduledInstall",
      "scheduledInstallDay": "sunday",
      "scheduledInstallTime": "03:00:00.0000000"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('7831a3a0-2e72-484c-bd77-4703e5629726')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "7831a3a0-2e72-484c-bd77-4703e5629726_51fe946d-62e1-46d9-b989-8b32c2f21874",
        "source": "direct",
        "sourceId": "7831a3a0-2e72-484c-bd77-4703e5629726",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "51fe946d-62e1-46d9-b989-8b32c2f21874"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsUpdateForBusinessConfiguration",
    "id": "5b620959-d929-4c96-8847-443e2fcbf5de",
    "lastModifiedDateTime": "2025-08-12T12:20:43.3854683Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-08-01T16:20:22.4731345Z",
    "description": null,
    "displayName": "Windows Autopatch Update Policy - Weekend Ring 1 - Test",
    "version": 7,
    "deliveryOptimizationMode": "userDefined",
    "prereleaseFeatures": "userDefined",
    "automaticUpdateMode": "autoInstallAndRebootAtScheduledTime",
    "microsoftUpdateServiceAllowed": true,
    "driversExcluded": false,
    "qualityUpdatesDeferralPeriodInDays": 0,
    "featureUpdatesDeferralPeriodInDays": 0,
    "qualityUpdatesPaused": false,
    "featureUpdatesPaused": false,
    "qualityUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesPauseExpiryDateTime": "0001-01-01T00:00:00Z",
    "businessReadyUpdatesOnly": "userDefined",
    "skipChecksBeforeRestart": false,
    "updateWeeks": "everyWeek",
    "qualityUpdatesPauseStartDate": null,
    "featureUpdatesPauseStartDate": null,
    "featureUpdatesRollbackWindowInDays": 30,
    "qualityUpdatesWillBeRolledBack": null,
    "featureUpdatesWillBeRolledBack": null,
    "qualityUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "featureUpdatesRollbackStartDateTime": "0001-01-01T00:00:00Z",
    "engagedRestartDeadlineInDays": null,
    "engagedRestartSnoozeScheduleInDays": null,
    "engagedRestartTransitionScheduleInDays": null,
    "deadlineForFeatureUpdatesInDays": 5,
    "deadlineForQualityUpdatesInDays": 1,
    "deadlineGracePeriodInDays": 0,
    "postponeRebootUntilAfterDeadline": false,
    "autoRestartNotificationDismissal": "notConfigured",
    "scheduleRestartWarningInHours": null,
    "scheduleImminentRestartWarningInMinutes": null,
    "userPauseAccess": "disabled",
    "userWindowsUpdateScanAccess": "notConfigured",
    "updateNotificationLevel": "defaultNotifications",
    "allowWindows11Upgrade": false,
    "installationSchedule": {
      "@odata.type": "#microsoft.graph.windowsUpdateScheduledInstall",
      "scheduledInstallDay": "saturday",
      "scheduledInstallTime": "03:00:00.0000000"
    },
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('5b620959-d929-4c96-8847-443e2fcbf5de')/microsoft.graph.windowsUpdateForBusinessConfiguration/assignments",
    "assignments": [
      {
        "id": "5b620959-d929-4c96-8847-443e2fcbf5de_a01e98cc-441a-4064-86ce-c2b4e801ccd8",
        "source": "direct",
        "sourceId": "5b620959-d929-4c96-8847-443e2fcbf5de",
        "intent": "apply",
        "target": {
          "@odata.type": "#microsoft.graph.groupAssignmentTarget",
          "deviceAndAppManagementAssignmentFilterId": null,
          "deviceAndAppManagementAssignmentFilterType": "none",
          "groupId": "a01e98cc-441a-4064-86ce-c2b4e801ccd8"
        }
      }
    ]
  },
  {
    "@odata.type": "#microsoft.graph.windowsWiredNetworkConfiguration",
    "id": "c8c3a5ea-02a3-45bd-99d5-c52f18559292",
    "lastModifiedDateTime": "2025-09-16T13:47:37.8801196Z",
    "roleScopeTagIds": [
      "0"
    ],
    "supportsScopeTags": true,
    "deviceManagementApplicabilityRuleOsEdition": null,
    "deviceManagementApplicabilityRuleOsVersion": null,
    "deviceManagementApplicabilityRuleDeviceMode": null,
    "createdDateTime": "2025-09-16T13:47:37.8801196Z",
    "description": null,
    "displayName": "wiredn",
    "version": 1,
    "authenticationType": "user",
    "cacheCredentials": true,
    "authenticationPeriodInSeconds": null,
    "authenticationRetryDelayPeriodInSeconds": null,
    "eapolStartPeriodInSeconds": null,
    "maximumEAPOLStartMessages": null,
    "maximumAuthenticationFailures": null,
    "enforce8021X": null,
    "authenticationBlockPeriodInMinutes": null,
    "eapType": "eapTls",
    "trustedServerCertificateNames": [],
    "authenticationMethod": "certificate",
    "secondaryAuthenticationMethod": null,
    "innerAuthenticationProtocolForEAPTTLS": null,
    "outerIdentityPrivacyTemporaryValue": null,
    "performServerValidation": null,
    "disableUserPromptForServerValidation": null,
    "requireCryptographicBinding": null,
    "forceFIPSCompliance": null,
    "assignments@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/deviceConfigurations('c8c3a5ea-02a3-45bd-99d5-c52f18559292')/microsoft.graph.windowsWiredNetworkConfiguration/assignments",
    "assignments": []
  }
]
